[
  {
    "imdb_id": "tt0111161",
    "title": "The Shawshank Redemption",
    "year": "1994",
    "rated": "R",
    "runtime": "142 min",
    "genre": "Drama",
    "director": "Frank Darabont",
    "actors": "Tim Robbins, Morgan Freeman, Bob Gunton",
    "plot": "Chronicles the experiences of a formerly successful banker as a prisoner in the gloomy jailhouse of Shawshank after being found guilty of a crime he did not commit. The film portrays the man's unique way of dealing with his new, torturous life; along the way he befriends a number of fellow prisoners, most notably a wise long-term inmate named Red.",
    "language": "English",
    "country": "United States",
    "poster_url": "https://m.media-amazon.com/images/M/MV5BMDAyY2FhYjctNDc5OS00MDNlLThiMGUtY2UxYWVkNGY2ZjljXkEyXkFqcGc@._V1_SX300.jpg",
    "imdb_rating": "9.3"
  },
  {
    "imdb_id": "tt0068646",
    "title": "The Godfather",
    "year": "1972",
    "rated": "R",
    "runtime": "175 min",
    "genre": "Crime, Drama",
    "director": "Francis Ford Coppola",
    "actors": "Marlon Brando, Al Pacino, James Caan",
    "plot": "The Godfather \"Don\" Vito Corleone is the head of the Corleone mafia family in New York. He is at the event of his daughter's wedding. Michael, Vito's youngest son and a decorated WW II Marine is also present at the wedding. Michael seems to be uninterested in being a part of the family business. Vito is a powerful man, and is kind to all those who give him respect but is ruthless against those who do not. But when a powerful and treacherous rival wants to sell drugs and needs the Don's influence for the same, Vito refuses to do it. What follows is a clash between Vito's fading old values and the new ways which may cause Michael to do the thing he was most reluctant in doing and wage a mob war against all the other mafia families which could tear the Corleone family apart.",
    "language": "English, Italian, Latin",
    "country": "United States",
    "poster_url": "https://m.media-amazon.com/images/M/MV5BNGEwYjgwOGQtYjg5ZS00Njc1LTk2ZGEtM2QwZWQ2NjdhZTE5XkEyXkFqcGc@._V1_SX300.jpg",
    "imdb_rating": "9.2"
  },
  {
    "imdb_id": "tt0468569",
    "title": "The Dark Knight",
    "year": "2008",
    "rated": "PG-13",
    "runtime": "152 min",
    "genre": "Action, Crime, Drama",
    "director": "Christopher Nolan",
    "actors": "Christian Bale, Heath Ledger, Aaron Eckhart",
    "plot": "Set within a year after the events of Batman Begins (2005), Batman, Lieutenant James Gordon, and new District Attorney Harvey Dent successfully begin to round up the criminals that plague Gotham City, until a mysterious and sadistic criminal mastermind known only as \"The Joker\" appears in Gotham, creating a new wave of chaos. Batman's struggle against The Joker becomes deeply personal, forcing him to \"confront everything he believes\" and improve his technology to stop him. A love triangle develops between Bruce Wayne, Dent, and Rachel Dawes.",
    "language": "English, Mandarin",
    "country": "United States, United Kingdom",
    "poster_url": "https://m.media-amazon.com/images/M/MV5BMTMxNTMwODM0NF5BMl5BanBnXkFtZTcwODAyMTk2Mw@@._V1_SX300.jpg",
    "imdb_rating": "9.1"
  },
  {
    "imdb_id": "tt0071562",
    "title": "The Godfather Part II",
    "year": "1974",
    "rated": "R",
    "runtime": "202 min",
    "genre": "Crime, Drama",
    "director": "Francis Ford Coppola",
    "actors": "Al Pacino, Robert De Niro, Robert Duvall",
    "plot": "The continuing saga of the Corleone crime family tells the story of a young Vito Corleone growing up in Sicily and in 1910s New York; and follows Michael Corleone in the 1950s as he attempts to expand the family business into Las Vegas, Hollywood and Cuba.",
    "language": "English, Italian, Spanish, Latin, Sicilian",
    "country": "United States",
    "poster_url": "https://m.media-amazon.com/images/M/MV5BMDIxMzBlZDktZjMxNy00ZGI4LTgxNDEtYWRlNzRjMjJmOGQ1XkEyXkFqcGc@._V1_SX300.jpg",
    "imdb_rating": "9.0"
  },
  {
    "imdb_id": "tt0050083",
    "title": "12 Angry Men",
    "year": "1957",
    "rated": "Approved",
    "runtime": "96 min",
    "genre": "Crime, Drama",
    "director": "Sidney Lumet",
    "actors": "Martin Balsam, John Fiedler, Lee J. Cobb",
    "plot": "The defense and the prosecution have rested, and the jury is filing into the jury room to decide if a young man is guilty or innocent of murdering his father. What begins as an open-and-shut case of murder soon becomes a detective story that presents a succession of clues creating doubt, and a mini-drama of each of the jurors' prejudices and preconceptions about the trial, the accused, AND each other. Based on the play, all of the action takes place on the stage of the jury room.",
    "language": "English",
    "country": "United States",
    "poster_url": "https://m.media-amazon.com/images/M/MV5BYjE4NzdmOTYtYjc5Yi00YzBiLWEzNDEtNTgxZGQ2MWVkN2NiXkEyXkFqcGc@._V1_SX300.jpg",
    "imdb_rating": "9.0"
  },
  {
    "imdb_id": "tt0167260",
    "title": "The Lord of the Rings: The Return of the King",
    "year": "2003",
    "rated": "PG-13",
    "runtime": "201 min",
    "genre": "Adventure, Drama, Fantasy",
    "director": "Peter Jackson",
    "actors": "Elijah Wood, Viggo Mortensen, Ian McKellen",
    "plot": "The final confrontation between the forces of good and evil fighting for control of the future of Middle-earth. Frodo and Sam reach Mordor in their quest to destroy the One Ring, while Aragorn leads the forces of good against Sauron's evil army at the stone city of Minas Tirith.",
    "language": "English, Quenya, Old English, Sindarin",
    "country": "New Zealand, United States",
    "poster_url": "https://m.media-amazon.com/images/M/MV5BMTZkMjBjNWMtZGI5OC00MGU0LTk4ZTItODg2NWM3NTVmNWQ4XkEyXkFqcGc@._V1_SX300.jpg",
    "imdb_rating": "9.0"
  },
  {
    "imdb_id": "tt0108052",
    "title": "Schindler's List",
    "year": "1993",
    "rated": "R",
    "runtime": "195 min",
    "genre": "Biography, Drama, History",
    "director": "Steven Spielberg",
    "actors": "Liam Neeson, Ralph Fiennes, Ben Kingsley",
    "plot": "Oskar Schindler is a vain and greedy German businessman who becomes an unlikely humanitarian amid the barbaric German Nazi reign when he feels compelled to turn his factory into a refuge for Jews. Based on the true story of Oskar Schindler who managed to save about 1100 Jews from being gassed at the Auschwitz concentration camp, it is a testament to the good in all of us.",
    "language": "English, Hebrew, German, Polish, Latin",
    "country": "United States",
    "poster_url": "https://m.media-amazon.com/images/M/MV5BNjM1ZDQxYWUtMzQyZS00MTE1LWJmZGYtNGUyNTdlYjM3ZmVmXkEyXkFqcGc@._V1_SX300.jpg",
    "imdb_rating": "9.0"
  },
  {
    "imdb_id": "tt0120737",
    "title": "The Lord of the Rings: The Fellowship of the Ring",
    "year": "2001",
    "rated": "PG-13",
    "runtime": "178 min",
    "genre": "Adventure, Drama, Fantasy",
    "director": "Peter Jackson",
    "actors": "Alan Howard, Noel Appleby, Sean Astin",
    "plot": "An ancient Ring thought lost for centuries has been found, and through a strange twist of fate has been given to a small Hobbit named Frodo. When Gandalf discovers the Ring is in fact the One Ring of the Dark Lord Sauron, Frodo must make an epic quest to the Cracks of Doom in order to destroy it. However, he does not go alone. He is joined by Gandalf, Legolas the elf, Gimli the Dwarf, Aragorn, Boromir, and his three Hobbit friends Merry, Pippin, and Samwise. Through mountains, snow, darkness, forests, rivers and plains, facing evil and danger at every corner the Fellowship of the Ring must go. Their quest to destroy the One Ring is the only hope for the end of the Dark Lords reign.",
    "language": "English, Sindarin",
    "country": "New Zealand, United States, United Kingdom",
    "poster_url": "https://m.media-amazon.com/images/M/MV5BNzIxMDQ2YTctNDY4MC00ZTRhLTk4ODQtMTVlOWY4NTdiYmMwXkEyXkFqcGc@._V1_SX300.jpg",
    "imdb_rating": "8.9"
  },
  {
    "imdb_id": "tt0110912",
    "title": "Pulp Fiction",
    "year": "1994",
    "rated": "R",
    "runtime": "154 min",
    "genre": "Crime, Drama",
    "director": "Quentin Tarantino",
    "actors": "John Travolta, Uma Thurman, Samuel L. Jackson",
    "plot": "Jules Winnfield (Samuel L. Jackson) and Vincent Vega (John Travolta) are two hit men who are out to retrieve a suitcase stolen from their employer, mob boss Marsellus Wallace (Ving Rhames). Wallace has also asked Vincent to take his wife Mia (Uma Thurman) out a few days later when Wallace himself will be out of town. Butch Coolidge (Bruce Willis) is an aging boxer who is paid by Wallace to lose his fight. The lives of these seemingly unrelated people are woven together comprising of a series of funny, bizarre and uncalled-for incidents.",
    "language": "English, Spanish, French",
    "country": "United States",
    "poster_url": "https://m.media-amazon.com/images/M/MV5BYTViYTE3ZGQtNDBlMC00ZTAyLTkyODMtZGRiZDg0MjA2YThkXkEyXkFqcGc@._V1_SX300.jpg",
    "imdb_rating": "8.8"
  },
  {
    "imdb_id": "tt0060196",
    "title": "The Good, the Bad and the Ugly",
    "year": "1966",
    "rated": "R",
    "runtime": "178 min",
    "genre": "Adventure, Drama, Western",
    "director": "Sergio Leone",
    "actors": "Clint Eastwood, Eli Wallach, Lee Van Cleef",
    "plot": "Blondie, The Good (Clint Eastwood), is a professional gunslinger who is out trying to earn a few dollars. Angel Eyes, The Bad (Lee Van Cleef), is a hitman who always commits to a task and sees it through--as long as he's paid to do so. And Tuco, The Ugly (Eli Wallach), is a wanted outlaw trying to take care of his own hide. Tuco and Blondie share a partnership making money off of Tuco's bounty, but when Blondie unties the partnership, Tuco tries to hunt down Blondie. When Blondie and Tuco come across a horse carriage loaded with dead bodies, they soon learn from the only survivor, Bill Carson (Antonio Casale), that he and a few other men have buried a stash of gold in a cemetery. Unfortunately, Carson dies and Tuco only finds out the name of the cemetery, while Blondie finds out the name on the grave. Now the two must keep each other alive in order to find the gold. Angel Eyes (who had been looking for Bill Carson) discovers that Tuco and Blondie met with Carson and knows they know where the gold is; now he needs them to lead him to it. Now The Good, the Bad, and the Ugly must all battle it out to get their hands on $200,000.00 worth of gold.",
    "language": "English, Italian",
    "country": "Italy, Spain, West Germany, United States",
    "poster_url": "https://m.media-amazon.com/images/M/MV5BMWM5ZjQxM2YtNDlmYi00ZDNhLWI4MWUtN2VkYjBlMTY1ZTkwXkEyXkFqcGc@._V1_SX300.jpg",
    "imdb_rating": "8.8"
  },
  {
    "imdb_id": "tt0167261",
    "title": "The Lord of the Rings: The Two Towers",
    "year": "2002",
    "rated": "PG-13",
    "runtime": "179 min",
    "genre": "Adventure, Drama, Fantasy",
    "director": "Peter Jackson",
    "actors": "Elijah Wood, Ian McKellen, Viggo Mortensen",
    "plot": "The continuing quest of Frodo and the Fellowship to destroy the One Ring. Frodo and Sam discover they are being followed by the mysterious Gollum. Aragorn, the Elf archer Legolas, and Gimli the Dwarf encounter the besieged Rohan kingdom, whose once great King Theoden has fallen under Saruman's deadly spell.",
    "language": "English, Sindarin, Old English",
    "country": "New Zealand, United States",
    "poster_url": "https://m.media-amazon.com/images/M/MV5BMGQxMDdiOWUtYjc1Ni00YzM1LWE2NjMtZTg3Y2JkMjEzMTJjXkEyXkFqcGc@._V1_SX300.jpg",
    "imdb_rating": "8.8"
  },
  {
    "imdb_id": "tt0109830",
    "title": "Forrest Gump",
    "year": "1994",
    "rated": "PG-13",
    "runtime": "142 min",
    "genre": "Drama, Romance",
    "director": "Robert Zemeckis",
    "actors": "Tom Hanks, Robin Wright, Gary Sinise",
    "plot": "Forrest Gump is a simple man with a low I.Q. but good intentions. He is running through childhood with his best and only friend Jenny. His 'mama' teaches him the ways of life and leaves him to choose his destiny. Forrest joins the army for service in Vietnam, finding new friends called Dan and Bubba, he wins medals, creates a famous shrimp fishing fleet, inspires people to jog, starts a ping-pong craze, creates the smiley, writes bumper stickers and songs, donates to people and meets the president several times. However, this is all irrelevant to Forrest who can only think of his childhood sweetheart Jenny Curran, who has messed up her life. Although in the end all he wants to prove is that anyone can love anyone.",
    "language": "English",
    "country": "United States",
    "poster_url": "https://m.media-amazon.com/images/M/MV5BNDYwNzVjMTItZmU5YS00YjQ5LTljYjgtMjY2NDVmYWMyNWFmXkEyXkFqcGc@._V1_SX300.jpg",
    "imdb_rating": "8.8"
  },
  {
    "imdb_id": "tt0137523",
    "title": "Fight Club",
    "year": "1999",
    "rated": "R",
    "runtime": "139 min",
    "genre": "Crime, Drama, Thriller",
    "director": "David Fincher",
    "actors": "Edward Norton, Brad Pitt, Meat Loaf",
    "plot": "A nameless first person narrator (Edward Norton) attends support groups in attempt to subdue his emotional state and relieve his insomniac state. When he meets Marla (Helena Bonham Carter), another fake attendee of support groups, his life seems to become a little more bearable. However when he associates himself with Tyler (Brad Pitt) he is dragged into an underground fight club and soap making scheme. Together the two men spiral out of control and engage in competitive rivalry for love and power.",
    "language": "English",
    "country": "United States, Germany",
    "poster_url": "https://m.media-amazon.com/images/M/MV5BOTgyOGQ1NDItNGU3Ny00MjU3LTg2YWEtNmEyYjBiMjI1Y2M5XkEyXkFqcGc@._V1_SX300.jpg",
    "imdb_rating": "8.8"
  },
  {
    "imdb_id": "tt1375666",
    "title": "Inception",
    "year": "2010",
    "rated": "PG-13",
    "runtime": "148 min",
    "genre": "Action, Adventure, Sci-Fi",
    "director": "Christopher Nolan",
    "actors": "Leonardo DiCaprio, Joseph Gordon-Levitt, Elliot Page",
    "plot": "Dom Cobb is a skilled thief, the absolute best in the dangerous art of extraction, stealing valuable secrets from deep within the subconscious during the dream state, when the mind is at its most vulnerable. Cobb's rare ability has made him a coveted player in this treacherous new world of corporate espionage, but it has also made him an international fugitive and cost him everything he has ever loved. Now Cobb is being offered a chance at redemption. One last job could give him his life back but only if he can accomplish the impossible, inception. Instead of the perfect heist, Cobb and his team of specialists have to pull off the reverse: their task is not to steal an idea, but to plant one. If they succeed, it could be the perfect crime. But no amount of careful planning or expertise can prepare the team for the dangerous enemy that seems to predict their every move. An enemy that only Cobb could have seen coming.",
    "language": "English, Japanese, French",
    "country": "United States, United Kingdom",
    "poster_url": "https://m.media-amazon.com/images/M/MV5BMjAxMzY3NjcxNF5BMl5BanBnXkFtZTcwNTI5OTM0Mw@@._V1_SX300.jpg",
    "imdb_rating": "8.8"
  },
  {
    "imdb_id": "tt0080684",
    "title": "Star Wars: Episode V - The Empire Strikes Back",
    "year": "1980",
    "rated": "PG",
    "runtime": "124 min",
    "genre": "Action, Adventure, Fantasy",
    "director": "Irvin Kershner",
    "actors": "Mark Hamill, Harrison Ford, Carrie Fisher",
    "plot": "Luke Skywalker, Han Solo, Princess Leia and Chewbacca face attack by the Imperial forces and its AT-AT walkers on the ice planet Hoth. While Han and Leia escape in the Millennium Falcon, Luke travels to Dagobah in search of Yoda. Only with the Jedi Master's help will Luke survive when the Dark Side of the Force beckons him into the ultimate duel with Darth Vader.",
    "language": "English",
    "country": "United States",
    "poster_url": "https://m.media-amazon.com/images/M/MV5BMTkxNGFlNDktZmJkNC00MDdhLTg0MTEtZjZiYWI3MGE5NWIwXkEyXkFqcGc@._V1_SX300.jpg",
    "imdb_rating": "8.7"
  },
  {
    "imdb_id": "tt0133093",
    "title": "The Matrix",
    "year": "1999",
    "rated": "R",
    "runtime": "136 min",
    "genre": "Action, Sci-Fi",
    "director": "Lana Wachowski, Lilly Wachowski",
    "actors": "Keanu Reeves, Laurence Fishburne, Carrie-Anne Moss",
    "plot": "Thomas A. Anderson is a man living two lives. By day he is an average computer programmer and by night a hacker known as Neo. Neo has always questioned his reality, but the truth is far beyond his imagination. Neo finds himself targeted by the police when he is contacted by Morpheus, a legendary computer hacker branded a terrorist by the government. As a rebel against the machines, Neo must confront the agents: super-powerful computer programs devoted to stopping Neo and the entire human rebellion.",
    "language": "English",
    "country": "United States, Australia",
    "poster_url": "https://m.media-amazon.com/images/M/MV5BN2NmN2VhMTQtMDNiOS00NDlhLTliMjgtODE2ZTY0ODQyNDRhXkEyXkFqcGc@._V1_SX300.jpg",
    "imdb_rating": "8.7"
  },
  {
    "imdb_id": "tt0099685",
    "title": "Goodfellas",
    "year": "1990",
    "rated": "R",
    "runtime": "145 min",
    "genre": "Biography, Crime, Drama",
    "director": "Martin Scorsese",
    "actors": "Robert De Niro, Ray Liotta, Joe Pesci",
    "plot": "Henry Hill might be a small time gangster, who may have taken part in a robbery with Jimmy Conway and Tommy De Vito, two other gangsters who might have set their sights a bit higher. His two partners could kill off everyone else involved in the robbery, and slowly start to think about climbing up through the hierarchy of the Mob. Henry, however, might be badly affected by his partners' success, but will he consider stooping low enough to bring about the downfall of Jimmy and Tommy?",
    "language": "English, Italian, Hebrew, Yiddish",
    "country": "United States",
    "poster_url": "https://m.media-amazon.com/images/M/MV5BN2E5NzI2ZGMtY2VjNi00YTRjLWI1MDUtZGY5OWU1MWJjZjRjXkEyXkFqcGc@._V1_SX300.jpg",
    "imdb_rating": "8.7"
  },
  {
    "imdb_id": "tt0816692",
    "title": "Interstellar",
    "year": "2014",
    "rated": "PG-13",
    "runtime": "169 min",
    "genre": "Adventure, Drama, Sci-Fi",
    "director": "Christopher Nolan",
    "actors": "Matthew McConaughey, Anne Hathaway, Jessica Chastain",
    "plot": "Earth's future has been riddled by disasters, famines, and droughts. There is only one way to ensure mankind's survival: Interstellar travel. A newly discovered wormhole in the far reaches of our solar system allows a team of astronauts to go where no man has gone before, a planet that may have the right environment to sustain human life.",
    "language": "English",
    "country": "United States, United Kingdom, Canada",
    "poster_url": "https://m.media-amazon.com/images/M/MV5BYzdjMDAxZGItMjI2My00ODA1LTlkNzItOWFjMDU5ZDJlYWY3XkEyXkFqcGc@._V1_SX300.jpg",
    "imdb_rating": "8.7"
  },
  {
    "imdb_id": "tt0073486",
    "title": "One Flew Over the Cuckoo's Nest",
    "year": "1975",
    "rated": "R",
    "runtime": "133 min",
    "genre": "Drama",
    "director": "Milos Forman",
    "actors": "Jack Nicholson, Louise Fletcher, Michael Berryman",
    "plot": "McMurphy has a criminal past and has once again gotten himself into trouble and is sentenced by the court. To escape labor duties in prison, McMurphy pleads insanity and is sent to a ward for the mentally unstable. Once here, McMurphy both endures and stands witness to the abuse and degradation of the oppressive Nurse Ratched, who gains superiority and power through the flaws of the other inmates. McMurphy and the other inmates band together to make a rebellious stance against the atrocious Nurse.",
    "language": "English",
    "country": "United States",
    "poster_url": "https://m.media-amazon.com/images/M/MV5BYjBkMjgzMzYtNzRiMS00NDc3LWE4YTUtZjYxYjZhNjNhYzhhXkEyXkFqcGc@._V1_SX300.jpg",
    "imdb_rating": "8.7"
  },
  {
    "imdb_id": "tt0114369",
    "title": "Se7en",
    "year": "1995",
    "rated": "R",
    "runtime": "127 min",
    "genre": "Crime, Drama, Mystery",
    "director": "David Fincher",
    "actors": "Morgan Freeman, Brad Pitt, Kevin Spacey",
    "plot": "A film about two homicide detectives' (Morgan Freeman and Brad Pitt) desperate hunt for a serial killer who justifies his crimes as absolution for the world's ignorance of the Seven Deadly Sins. The movie takes us from the tortured remains of one victim to the next as the sociopathic \"John Doe\" (Kevin Spacey) sermonizes to Detectives Somerset and Mills -- one sin at a time. The sin of Gluttony comes first and the murderer's terrible capacity is graphically demonstrated in the dark and subdued tones characteristic of film noir. The seasoned and cultured but jaded Somerset researches the Seven Deadly Sins in an effort to understand the killer's modus operandi while the bright but green and impulsive Detective Mills (Pitt) scoffs at his efforts to get inside the mind of a killer...",
    "language": "English",
    "country": "United States",
    "poster_url": "https://m.media-amazon.com/images/M/MV5BY2IzNzMxZjctZjUxZi00YzAxLTk3ZjMtODFjODdhMDU5NDM1XkEyXkFqcGc@._V1_SX300.jpg",
    "imdb_rating": "8.6"
  },
  {
    "imdb_id": "tt0038650",
    "title": "It's a Wonderful Life",
    "year": "1946",
    "rated": "PG",
    "runtime": "130 min",
    "genre": "Drama, Family, Fantasy",
    "director": "Frank Capra",
    "actors": "James Stewart, Donna Reed, Lionel Barrymore",
    "plot": "George Bailey has spent his entire life giving of himself to the people of Bedford Falls. He has always longed to travel but never had the opportunity in order to prevent rich skinflint Mr. Potter from taking over the entire town. All that prevents him from doing so is George's modest building and loan company, which was founded by his generous father. But on Christmas Eve, George's Uncle Billy loses the business's $8,000 while intending to deposit it in the bank. Potter finds the misplaced money and hides it from Billy. When the bank examiner discovers the shortage later that night, George realizes that he will be held responsible and sent to jail and the company will collapse, finally allowing Potter to take over the town. Thinking of his wife, their young children, and others he loves will be better off with him dead, he contemplates suicide. But the prayers of his loved ones result in a gentle angel named Clarence coming to earth to help George, with the promise of earning his wings. He shows George what things would have been like if he had never been born.",
    "language": "English, French",
    "country": "United States",
    "poster_url": "https://m.media-amazon.com/images/M/MV5BMDM4OWFhYjEtNTE5Yy00NjcyLTg5N2UtZDQwNDZlYjlmNDU5XkEyXkFqcGc@._V1_SX300.jpg",
    "imdb_rating": "8.6"
  },
  {
    "imdb_id": "tt0102926",
    "title": "The Silence of the Lambs",
    "year": "1991",
    "rated": "R",
    "runtime": "118 min",
    "genre": "Crime, Drama, Horror",
    "director": "Jonathan Demme",
    "actors": "Jodie Foster, Anthony Hopkins, Scott Glenn",
    "plot": "F.B.I. trainee Clarice Starling (Jodie Foster) works hard to advance her career, while trying to hide or put behind her West Virginia roots, of which if some knew, would automatically classify her as being backward or white trash. After graduation, she aspires to work in the agency's Behavioral Science Unit under the leadership of Jack Crawford (Scott Glenn). While she is still a trainee, Crawford asks her to question Dr. Hannibal Lecter (Sir Anthony Hopkins), a psychiatrist imprisoned, thus far, for eight years in maximum security isolation for being a serial killer who cannibalized his victims. Clarice is able to figure out the assignment is to pick Lecter's brains to help them solve another serial murder case, that of someone coined by the media as \"Buffalo Bill\" (Ted Levine), who has so far killed five victims, all located in the eastern U.S., all young women, who are slightly overweight (especially around the hips), all who were drowned in natural bodies of water, and all who were stripped of large swaths of skin. She also figures that Crawford chose her, as a woman, to be able to trigger some emotional response from Lecter. After speaking to Lecter for the first time, she realizes that everything with him will be a psychological game, with her often having to read between the very cryptic lines he provides. She has to decide how much she will play along, as his request in return for talking to him is to expose herself emotionally to him. The case takes a more dire turn when a sixth victim is discovered, this one from who they are able to retrieve a key piece of evidence, if Lecter is being forthright as to its meaning. A potential seventh victim is high profile Catherine Martin (Brooke Smith), the daughter of Senator Ruth Martin (Diane Baker), which places greater scrutiny on the case as they search for a hopefully still alive Catherine. Who may factor into what happens is Dr. Frederick Chilton (Anthony Heald), the warden at the prison, an opportunist who sees the higher profile with Catherine, meaning a higher profile for himself if he can insert himself successfully into the proceedings.",
    "language": "English, Latin",
    "country": "United States",
    "poster_url": "https://m.media-amazon.com/images/M/MV5BNDdhOGJhYzctYzYwZC00YmI2LWI0MjctYjg4ODdlMDExYjBlXkEyXkFqcGc@._V1_SX300.jpg",
    "imdb_rating": "8.6"
  },
  {
    "imdb_id": "tt0047478",
    "title": "Seven Samurai",
    "year": "1954",
    "rated": "Not Rated",
    "runtime": "207 min",
    "genre": "Action, Drama",
    "director": "Akira Kurosawa",
    "actors": "Toshirô Mifune, Takashi Shimura, Keiko Tsushima",
    "plot": "A veteran samurai, who has fallen on hard times, answers a village's request for protection from bandits. He gathers 6 other samurai to help him, and they teach the townspeople how to defend themselves, and they supply the samurai with three small meals a day. The film culminates in a giant battle when 40 bandits attack the village.",
    "language": "Japanese",
    "country": "Japan",
    "poster_url": "https://m.media-amazon.com/images/M/MV5BZjliMWExOTMtZDQ3ZS00NWU3LWIyN2EtMjllNzk3ZTNlYzg4XkEyXkFqcGc@._V1_SX300.jpg",
    "imdb_rating": "8.6"
  },
  {
    "imdb_id": "tt0120815",
    "title": "Saving Private Ryan",
    "year": "1998",
    "rated": "R",
    "runtime": "169 min",
    "genre": "Drama, War",
    "director": "Steven Spielberg",
    "actors": "Tom Hanks, Matt Damon, Tom Sizemore",
    "plot": "Opening with the Allied invasion of Normandy on 6 June 1944, members of the 2nd Ranger Battalion under Cpt. Miller fight ashore to secure a beachhead. Amidst the fighting, two brothers are killed in action. Earlier in New Guinea, a third brother is KIA. Their mother, Mrs. Ryan, is to receive all three of the grave telegrams on the same day. The United States Army Chief of Staff, George C. Marshall, is given an opportunity to alleviate some of her grief when he learns of a fourth brother, Private James Ryan, and decides to send out 8 men (Cpt. Miller and select members from 2nd Rangers) to find him and bring him back home to his mother...",
    "language": "English, French, German, Czech",
    "country": "United States",
    "poster_url": "https://m.media-amazon.com/images/M/MV5BZGZhZGQ1ZWUtZTZjYS00MDJhLWFkYjctN2ZlYjE5NWYwZDM2XkEyXkFqcGc@._V1_SX300.jpg",
    "imdb_rating": "8.6"
  },
  {
    "imdb_id": "tt0120689",
    "title": "The Green Mile",
    "year": "1999",
    "rated": "R",
    "runtime": "189 min",
    "genre": "Crime, Drama, Fantasy",
    "director": "Frank Darabont",
    "actors": "Tom Hanks, Michael Clarke Duncan, David Morse",
    "plot": "Death Row guards at a penitentiary, in the 1930's, have a moral dilemma with their job when they discover one of their prisoners, a convicted murderer, has a special gift.",
    "language": "English, French",
    "country": "United States",
    "poster_url": "https://m.media-amazon.com/images/M/MV5BMTUxMzQyNjA5MF5BMl5BanBnXkFtZTYwOTU2NTY3._V1_SX300.jpg",
    "imdb_rating": "8.6"
  },
  {
    "imdb_id": "tt0317248",
    "title": "City of God",
    "year": "2002",
    "rated": "R",
    "runtime": "130 min",
    "genre": "Crime, Drama",
    "director": "Fernando Meirelles, Kátia Lund",
    "actors": "Alexandre Rodrigues, Leandro Firmino, Matheus Nachtergaele",
    "plot": "Brazil, 1960s, City of God. The Tender Trio robs motels and gas trucks. Younger kids watch and learn well...too well. 1970s: Li'l Zé has prospered very well and owns the city. He causes violence and fear as he wipes out rival gangs without mercy. His best friend Bené is the only one to keep him on the good side of sanity. Rocket has watched these two gain power for years, and he wants no part of it. he keeps getting swept up in the madness. All he wants to do is take pictures. 1980s: Things are out of control between the last two remaining gangs...will it ever end? Welcome to the City of God.",
    "language": "Portuguese",
    "country": "Brazil, France",
    "poster_url": "https://m.media-amazon.com/images/M/MV5BYjY4NGI5OTUtY2ZlZS00Zjk4LTk5N2MtN2JmYWVjNGNmMGRlXkEyXkFqcGc@._V1_SX300.jpg",
    "imdb_rating": "8.6"
  },
  {
    "imdb_id": "tt0118799",
    "title": "Life Is Beautiful",
    "year": "1997",
    "rated": "PG-13",
    "runtime": "116 min",
    "genre": "Comedy, Drama, Romance",
    "director": "Roberto Benigni",
    "actors": "Roberto Benigni, Nicoletta Braschi, Giorgio Cantarini",
    "plot": "In 1930s Italy, a carefree Jewish waiter named Guido starts a fairy tale life by courting and marrying a lovely woman from a nearby city. Guido and his wife have a son and live happily together until the occupation of Italy by German forces. In an attempt to hold his family together and help his son survive the horrors of a Jewish Concentration Camp, Guido imagines that the Holocaust is a game and that the grand prize for winning is a tank.",
    "language": "Italian, German, English",
    "country": "Italy",
    "poster_url": "https://m.media-amazon.com/images/M/MV5BZTBhOGYzZjQtYzE0Mi00MGIwLWE0MWYtNzMxNTM2OTFkM2NjXkEyXkFqcGc@._V1_SX300.jpg",
    "imdb_rating": "8.6"
  },
  {
    "imdb_id": "tt0103064",
    "title": "Terminator 2: Judgment Day",
    "year": "1991",
    "rated": "R",
    "runtime": "137 min",
    "genre": "Action, Adventure, Sci-Fi",
    "director": "James Cameron",
    "actors": "Arnold Schwarzenegger, Linda Hamilton, Edward Furlong",
    "plot": "Over 10 years have passed since the first machine called The Terminator tried to kill Sarah Connor and her unborn son, John. The man who will become the future leader of the human resistance against the Machines is now a healthy young boy. However, another Terminator, called the T-1000, is sent back through time by the supercomputer Skynet. This new Terminator is more advanced and more powerful than its predecessor and its mission is to kill John Connor when he's still a child. However, Sarah and John do not have to face the threat of the T-1000 alone. Another Terminator (identical to the same model that tried and failed to kill Sarah Connor in 1984) is also sent back through time to protect them. Now, the battle for tomorrow has begun.",
    "language": "English, Spanish",
    "country": "United States, France",
    "poster_url": "https://m.media-amazon.com/images/M/MV5BNGMyMGNkMDUtMjc2Ni00NWFlLTgyODEtZTY2MzBiZTg0OWZiXkEyXkFqcGc@._V1_SX300.jpg",
    "imdb_rating": "8.6"
  },
  {
    "imdb_id": "tt0076759",
    "title": "Star Wars: Episode IV - A New Hope",
    "year": "1977",
    "rated": "PG",
    "runtime": "121 min",
    "genre": "Action, Adventure, Fantasy",
    "director": "George Lucas",
    "actors": "Mark Hamill, Harrison Ford, Carrie Fisher",
    "plot": "The Imperial Forces, under orders from cruel Darth Vader, hold Princess Leia hostage in their efforts to quell the rebellion against the Galactic Empire. Luke Skywalker and Han Solo, captain of the Millennium Falcon, work together with the companionable droid duo R2-D2 and C-3PO to rescue the beautiful princess, help the Rebel Alliance and restore freedom and justice to the Galaxy.",
    "language": "English",
    "country": "United States",
    "poster_url": "https://m.media-amazon.com/images/M/MV5BOGUwMDk0Y2MtNjBlNi00NmRiLTk2MWYtMGMyMDlhYmI4ZDBjXkEyXkFqcGc@._V1_SX300.jpg",
    "imdb_rating": "8.6"
  },
  {
    "imdb_id": "tt0088763",
    "title": "Back to the Future",
    "year": "1985",
    "rated": "PG",
    "runtime": "116 min",
    "genre": "Adventure, Comedy, Sci-Fi",
    "director": "Robert Zemeckis",
    "actors": "Michael J. Fox, Christopher Lloyd, Lea Thompson",
    "plot": "Marty McFly, a typical American teenager of the Eighties, is accidentally sent back to 1955 in a plutonium-powered DeLorean \"time machine\" invented by a slightly mad scientist. During his often hysterical, always amazing trip back in time, Marty must make certain his teenage parents-to-be meet and fall in love - so he can get back to the future.",
    "language": "English",
    "country": "United States",
    "poster_url": "https://m.media-amazon.com/images/M/MV5BZmM3ZjE0NzctNjBiOC00MDZmLTgzMTUtNGVlOWFlOTNiZDJiXkEyXkFqcGc@._V1_SX300.jpg",
    "imdb_rating": "8.5"
  },
  {
    "imdb_id": "tt0245429",
    "title": "Spirited Away",
    "year": "2001",
    "rated": "PG",
    "runtime": "124 min",
    "genre": "Animation, Adventure, Family",
    "director": "Hayao Miyazaki",
    "actors": "Rumi Hiiragi, Miyu Irino, Mari Natsuki",
    "plot": "Chihiro and her parents are moving to a small Japanese town in the countryside, much to Chihiro's dismay. On the way to their new home, Chihiro's father makes a wrong turn and drives down a lonely one-lane road which dead-ends in front of a tunnel. Her parents decide to stop the car and explore the area. They go through the tunnel and find an abandoned amusement park on the other side, with its own little town. When her parents see a restaurant with great-smelling food but no staff, they decide to eat and pay later. However, Chihiro refuses to eat and decides to explore the theme park a bit more. She meets a boy named Haku who tells her that Chihiro and her parents are in danger, and they must leave immediately. She runs to the restaurant and finds that her parents have turned into pigs. In addition, the theme park turns out to be a town inhabited by demons, spirits, and evil gods. At the center of the town is a bathhouse where these creatures go to relax. The owner of the bathhouse is the evil witch Yubaba, who is intent on keeping all trespassers as captive workers, including Chihiro. Chihiro must rely on Haku to save her parents in hopes of returning to their world.",
    "language": "Japanese, English",
    "country": "Japan, United States",
    "poster_url": "https://m.media-amazon.com/images/M/MV5BNTEyNmEwOWUtYzkyOC00ZTQ4LTllZmUtMjk0Y2YwOGUzYjRiXkEyXkFqcGc@._V1_SX300.jpg",
    "imdb_rating": "8.6"
  },
  {
    "imdb_id": "tt0253474",
    "title": "The Pianist",
    "year": "2002",
    "rated": "R",
    "runtime": "150 min",
    "genre": "Biography, Drama, Music",
    "director": "Roman Polanski",
    "actors": "Adrien Brody, Emilia Fox, Michal Zebrowski",
    "plot": "In this adaptation of the autobiography \"The Pianist: The Extraordinary True Story of One Man's Survival in Warsaw, 1939-1945,\" Wladyslaw Szpilman, a Polish Jewish radio station pianist, sees Warsaw change gradually as World War II begins. Szpilman is forced into the Warsaw Ghetto, but is later separated from his family during Operation Reinhard. From this time until the concentration camp prisoners are released, Szpilman hides in various locations among the ruins of Warsaw.",
    "language": "English, German, Russian",
    "country": "France, Poland, Germany, United Kingdom, United States",
    "poster_url": "https://m.media-amazon.com/images/M/MV5BMjEwNmEwYjgtNTk3ZC00NjljLTg5ZDctZTY3ZGQwZjRkZmQxXkEyXkFqcGc@._V1_SX300.jpg",
    "imdb_rating": "8.5"
  },
  {
    "imdb_id": "tt0172495",
    "title": "Gladiator",
    "year": "2000",
    "rated": "R",
    "runtime": "155 min",
    "genre": "Action, Adventure, Drama",
    "director": "Ridley Scott",
    "actors": "Russell Crowe, Joaquin Phoenix, Connie Nielsen",
    "plot": "Maximus is a powerful Roman general, loved by the people and the aging Emperor, Marcus Aurelius. Before his death, the Emperor chooses Maximus to be his heir over his own son, Commodus, and a power struggle leaves Maximus and his family condemned to death. The powerful general is unable to save his family, and his loss of will allows him to get captured and put into the Gladiator games until he dies. The only desire that fuels him now is the chance to rise to the top so that he will be able to look into the eyes of the man who will feel his revenge.",
    "language": "English",
    "country": "United States, United Kingdom, Malta, Morocco",
    "poster_url": "https://m.media-amazon.com/images/M/MV5BYWQ4YmNjYjEtOWE1Zi00Y2U4LWI4NTAtMTU0MjkxNWQ1ZmJiXkEyXkFqcGc@._V1_SX300.jpg",
    "imdb_rating": "8.5"
  },
  {
    "imdb_id": "tt6751668",
    "title": "Parasite",
    "year": "2019",
    "rated": "R",
    "runtime": "132 min",
    "genre": "Drama, Thriller",
    "director": "Bong Joon Ho",
    "actors": "Song Kang-ho, Lee Sun-kyun, Cho Yeo-jeong",
    "plot": "The Kims - mother and father Chung-sook and Ki-taek, and their young adult offspring, son Ki-woo and daughter Ki-jung - are a poor family living in a shabby and cramped half basement apartment in a busy lower working class commercial district of Seoul. Without even knowing it, they, especially Mr. and Mrs. Kim, literally smell of poverty. Often as a collective, they perpetrate minor scams to get by, and even when they have jobs, they do the minimum work required. Ki-woo is the one who has dreams of getting out of poverty by one day going to university. Despite not having that university education, Ki-woo is chosen by his university student friend Min, who is leaving to go to school, to take over his tutoring job to Park Da-hye, who Min plans to date once he returns to Seoul and she herself is in university. The Parks are a wealthy family who for four years have lived in their modernistic house designed by and the former residence of famed architect Namgoong. While Mr. and Mrs. Park are all about status, Mrs. Park has a flighty, simpleminded mentality and temperament, which Min tells Ki-woo to feel comfortable in lying to her about his education to get the job. In getting the job, Ki-woo further learns that Mrs. Park is looking for an art therapist for the Parks' adolescent son, Da-song, Ki-woo quickly recommending his professional art therapist friend \"Jessica\", really Ki-jung who he knows can pull off the scam in being the easiest liar of the four Kims. In Ki-woo also falling for Da-hye, he begins to envision himself in that house, and thus the Kims as a collective start a plan for all the Kims, like Ki-jung using assumed names, to replace existing servants in the Parks' employ in orchestrating reasons for them to be fired. The most difficult to get rid of may be Moon-gwang, the Parks' housekeeper who literally came with the house - she Namgoong's housekeeper when he lived there - and thus knows all the little nooks and crannies of it better than the Parks themselves. The question then becomes how far the Kims can take this scam in their quest to become their version of the Parks.",
    "language": "Korean, English",
    "country": "South Korea",
    "poster_url": "https://m.media-amazon.com/images/M/MV5BYjk1Y2U4MjQtY2ZiNS00OWQyLWI3MmYtZWUwNmRjYWRiNWNhXkEyXkFqcGc@._V1_SX300.jpg",
    "imdb_rating": "8.5"
  },
  {
    "imdb_id": "tt0054215",
    "title": "Psycho",
    "year": "1960",
    "rated": "R",
    "runtime": "109 min",
    "genre": "Drama, Horror, Mystery",
    "director": "Alfred Hitchcock",
    "actors": "Anthony Perkins, Janet Leigh, Vera Miles",
    "plot": "Phoenix office worker Marion Crane is fed up with the way life has treated her. She has to meet her lover Sam in lunch breaks, and they cannot get married because Sam has to give most of his money away in alimony. One Friday, Marion is trusted to bank forty thousand dollars by her employer. Seeing the opportunity to take the money and start a new life, Marion leaves town and heads towards Sam's California store. Tired after the long drive and caught in a storm, she gets off the main highway and pulls into the Bates Motel. The motel is managed by a quiet young man called Norman who seems to be dominated by his mother.",
    "language": "English",
    "country": "United States",
    "poster_url": "https://m.media-amazon.com/images/M/MV5BYjZhMzFiZjItODA3ZC00MmRhLWIzMGYtMmVjOWUwYTA3MTRjXkEyXkFqcGc@._V1_SX300.jpg",
    "imdb_rating": "8.5"
  },
  {
    "imdb_id": "tt0095327",
    "title": "Grave of the Fireflies",
    "year": "1988",
    "rated": "Not Rated",
    "runtime": "88 min",
    "genre": "Animation, Drama, War",
    "director": "Isao Takahata",
    "actors": "Tsutomu Tatsumi, Ayano Shiraishi, Akemi Yamaguchi",
    "plot": "The story of Seita and Setsuko, two young Japanese siblings, living in the declining days of World War II. When an American firebombing separates the two children from their parents, the two siblings must rely completely on one another while they struggle to fight for their survival.",
    "language": "Japanese",
    "country": "Japan",
    "poster_url": "https://m.media-amazon.com/images/M/MV5BNTY5MmE2OGMtN2IxNC00MDY4LTkwMGEtZDUzOTYyNWE0ZTNjXkEyXkFqcGc@._V1_SX300.jpg",
    "imdb_rating": "8.5"
  },
  {
    "imdb_id": "tt0110357",
    "title": "The Lion King",
    "year": "1994",
    "rated": "G",
    "runtime": "88 min",
    "genre": "Animation, Adventure, Drama",
    "director": "Roger Allers, Rob Minkoff",
    "actors": "Rowan Atkinson, Matthew Broderick, Niketa Calame-Harris",
    "plot": "A young lion prince is cast out of his pride by his cruel uncle, who claims he killed his father. While the uncle rules with an iron paw, the prince grows up beyond the Savannah, living by a philosophy: No worries for the rest of your days. But when his past comes to haunt him, the young prince must decide his fate: Will he remain an outcast or face his demons and become what he needs to be?",
    "language": "English, Swahili, Xhosa, Zulu",
    "country": "United States",
    "poster_url": "https://m.media-amazon.com/images/M/MV5BZGRiZDZhZjItM2M3ZC00Y2IyLTk3Y2MtMWY5YjliNDFkZTJlXkEyXkFqcGc@._V1_SX300.jpg",
    "imdb_rating": "8.5"
  },
  {
    "imdb_id": "tt0056058",
    "title": "Harakiri",
    "year": "1962",
    "rated": "Not Rated",
    "runtime": "133 min",
    "genre": "Drama, Mystery",
    "director": "Masaki Kobayashi",
    "actors": "Tatsuya Nakadai, Akira Ishihama, Shima Iwashita",
    "plot": "Peace in 17th-century Japan causes the Shogunate's breakup of warrior clans, throwing thousands of samurai out of work and into poverty. An honorable end to such fate under the samurai code is ritual suicide, or hara-kiri (self-inflicted disembowelment). An elder warrior, Hanshiro Tsugumo (Tatsuya Nakadai) seeks admittance to the house of a feudal lord to commit the act. There, he learns of the fate of his son-in-law, a young samurai who sought work at the house but was instead barbarically forced to commit traditional hara-kiri in an excruciating manner with a dull bamboo blade. In flashbacks the samurai tells the tragic story of his son-in-law, and how he was forced to sell his real sword to support his sick wife and child. Tsugumo thus sets in motion a tense showdown of revenge against the house.",
    "language": "Japanese",
    "country": "Japan",
    "poster_url": "https://m.media-amazon.com/images/M/MV5BZThiZjU5ZDQtZDI4Mi00ZGYyLTkzOTktYmIzZTFlZTkxYzg5XkEyXkFqcGc@._V1_SX300.jpg",
    "imdb_rating": "8.6"
  },
  {
    "imdb_id": "tt0407887",
    "title": "The Departed",
    "year": "2006",
    "rated": "R",
    "runtime": "151 min",
    "genre": "Crime, Drama, Thriller",
    "director": "Martin Scorsese",
    "actors": "Leonardo DiCaprio, Matt Damon, Jack Nicholson",
    "plot": "In this crime-action tour de force, the South Boston state police force is waging war on Irish-American organized crime. Young undercover cop Billy Costigan is assigned to infiltrate the mob syndicate run by gangland chief Frank Costello. While Billy quickly gains Costello's confidence, Colin Sullivan, a hardened young criminal who has infiltrated the state police as an informer for the syndicate is rising to a position of power in the Special Investigation Unit. Each man becomes deeply consumed by their double lives, gathering information about the plans and counter-plans of the operations they have penetrated. But when it becomes clear to both the mob and the police that there is a mole in their midst, Billy and Colin are suddenly in danger of being caught and exposed to the enemy - and each must race to uncover the identity of the other man in time to save themselves. But is either willing to turn on their friends and comrades they've made during their long stints undercover?",
    "language": "English, Cantonese",
    "country": "United States, Hong Kong",
    "poster_url": "https://m.media-amazon.com/images/M/MV5BMTI1MTY2OTIxNV5BMl5BanBnXkFtZTYwNjQ4NjY3._V1_SX300.jpg",
    "imdb_rating": "8.5"
  },
  {
    "imdb_id": "tt2582802",
    "title": "Whiplash",
    "year": "2014",
    "rated": "R",
    "runtime": "106 min",
    "genre": "Drama, Music",
    "director": "Damien Chazelle",
    "actors": "Miles Teller, J.K. Simmons, Melissa Benoist",
    "plot": "Nineteen year old Andrew Niemann wants to be the greatest jazz drummer in the world, in a league with Buddy Rich. This goal is despite not coming from a pedigree of greatest, musical or otherwise, with Jim, his high school teacher father, being a failed writer. Andrew is starting his first year at Shaffer Conservatory of Music, the best music school in the United States. At Shaffer, being the best means being accepted to study under Terence Fletcher and being asked to play in his studio band, which represents the school at jazz competitions. Based on their less than positive first meeting, Andrew is surprised that Fletcher asks him to join the band, albeit in the alternate drummer position which he is more than happy to do initially. Andrew quickly learns that Fletcher operates on fear and intimidation, never settling for what he considers less than the best each and every time. Being the best in Fletcher's mind does not only entail playing well, but knowing that you're playing well and if not what you're doing wrong. His modus operandi creates an atmosphere of fear and of every man or woman for him/herself within the band. Regardless, Andrew works hard to be the best. He has to figure out his life priorities and what he is willing to sacrifice to be the best. The other question becomes how much emotional abuse he will endure by Fletcher to reach that greatness, which he may believe he can only achieve with the avenues opened up by Fletcher.",
    "language": "English",
    "country": "United States",
    "poster_url": "https://m.media-amazon.com/images/M/MV5BMDFjOWFkYzktYzhhMC00NmYyLTkwY2EtYjViMDhmNzg0OGFkXkEyXkFqcGc@._V1_SX300.jpg",
    "imdb_rating": "8.5"
  },
  {
    "imdb_id": "tt0482571",
    "title": "The Prestige",
    "year": "2006",
    "rated": "PG-13",
    "runtime": "130 min",
    "genre": "Drama, Mystery, Sci-Fi",
    "director": "Christopher Nolan",
    "actors": "Christian Bale, Hugh Jackman, Scarlett Johansson",
    "plot": "In the end of the nineteenth century, in London, Robert Angier, his beloved wife Julia McCullough, and Alfred Borden are friends and assistants of a magician. When Julia accidentally dies during a performance, Robert blames Alfred for her death, and they become enemies. Both become famous and rival magicians, sabotaging the performance of the other on the stage. When Alfred performs a successful trick, Robert becomes obsessed trying to disclose the secret of his competitor with tragic consequences.",
    "language": "English",
    "country": "United Kingdom, United States",
    "poster_url": "https://m.media-amazon.com/images/M/MV5BMTM3MzQ5MjQ5OF5BMl5BanBnXkFtZTcwMTQ3NzMzMw@@._V1_SX300.jpg",
    "imdb_rating": "8.5"
  },
  {
    "imdb_id": "tt0120586",
    "title": "American History X",
    "year": "1998",
    "rated": "R",
    "runtime": "119 min",
    "genre": "Crime, Drama",
    "director": "Tony Kaye",
    "actors": "Edward Norton, Edward Furlong, Beverly D'Angelo",
    "plot": "Derek Vineyard is paroled after serving 3 years in prison for brutally killing two black men who tried to break into/steal his truck. Through his brother's, Danny Vineyard, narration, we learn that before going to prison, Derek was a skinhead and the leader of a violent white supremacist gang that committed acts of racial crime throughout L.A. and his actions greatly influenced Danny. Reformed and fresh out of prison, Derek severs contact with the gang and becomes determined to keep Danny from going down the same violent path as he did.",
    "language": "English",
    "country": "United States",
    "poster_url": "https://m.media-amazon.com/images/M/MV5BMzhiOTQ0NDItOTg0Zi00OGVmLWE0OGEtMTI4NDM0NWMxZWU4XkEyXkFqcGc@._V1_SX300.jpg",
    "imdb_rating": "8.5"
  },
  {
    "imdb_id": "tt0110413",
    "title": "Léon: The Professional",
    "year": "1994",
    "rated": "R",
    "runtime": "110 min",
    "genre": "Action, Crime, Drama",
    "director": "Luc Besson",
    "actors": "Jean Reno, Gary Oldman, Natalie Portman",
    "plot": "After her father, step-mother, step-sister and little brother are killed by her father's employers, the 12-year-old daughter of an abject drug dealer manages to take refuge in the apartment of a professional hitman who at her request teaches her the methods of his job so she can take her revenge on the corrupt DEA agent who ruined her life by killing her beloved brother.",
    "language": "English, Italian, French",
    "country": "France, United States",
    "poster_url": "https://m.media-amazon.com/images/M/MV5BNGRkYTNhOWQtYmI0Ni00MjZhLWJmMzAtMTA2Mjg4NGNiNDU0XkEyXkFqcGc@._V1_SX300.jpg",
    "imdb_rating": "8.5"
  },
  {
    "imdb_id": "tt9362722",
    "title": "Spider-Man: Across the Spider-Verse",
    "year": "2023",
    "rated": "PG",
    "runtime": "140 min",
    "genre": "Animation, Action, Adventure",
    "director": "Joaquim Dos Santos, Kemp Powers, Justin K. Thompson",
    "actors": "Shameik Moore, Hailee Steinfeld, Brian Tyree Henry",
    "plot": "Miles Morales returns for the next chapter of the Oscar®-winning Spider-Verse saga, an epic adventure that will transport Brooklyn's full-time, friendly neighborhood Spider-Man across the Multiverse to join forces with Gwen Stacy and a new team of Spider-People to face off with a villain more powerful than anything they have ever encountered.",
    "language": "English",
    "country": "United States",
    "poster_url": "https://m.media-amazon.com/images/M/MV5BNThiZjA3MjItZGY5Ni00ZmJhLWEwN2EtOTBlYTA4Y2E0M2ZmXkEyXkFqcGc@._V1_SX300.jpg",
    "imdb_rating": "8.5"
  },
  {
    "imdb_id": "tt0095765",
    "title": "Cinema Paradiso",
    "year": "1988",
    "rated": "PG",
    "runtime": "174 min",
    "genre": "Drama, Romance",
    "director": "Giuseppe Tornatore",
    "actors": "Philippe Noiret, Enzo Cannavale, Antonella Attili",
    "plot": "A boy who grew up in a native Sicilian Village returns home as a famous director after receiving news about the death of an old friend. Told in a flashback, Salvatore reminiscences about his childhood and his relationship with Alfredo, a projectionist at Cinema Paradiso. Under the fatherly influence of Alfredo, Salvatore fell in love with film making, with the duo spending many hours discussing about films and Alfredo painstakingly teaching Salvatore the skills that became a stepping stone for the young boy into the world of film making. The film brings the audience through the changes in cinema and the dying trade of traditional film making, editing and screening. It also explores a young boy's dream of leaving his little town to foray into the world outside.",
    "language": "Italian",
    "country": "Italy, France",
    "poster_url": "https://m.media-amazon.com/images/M/MV5BMTljNzc4YWEtYTZlMS00ODMyLWIwMTAtNWQxY2VkMDEwYTk5XkEyXkFqcGc@._V1_SX300.jpg",
    "imdb_rating": "8.5"
  },
  {
    "imdb_id": "tt0034583",
    "title": "Casablanca",
    "year": "1942",
    "rated": "PG",
    "runtime": "102 min",
    "genre": "Drama, Romance, War",
    "director": "Michael Curtiz",
    "actors": "Humphrey Bogart, Ingrid Bergman, Paul Henreid",
    "plot": "The story of Rick Blaine, a cynical world-weary ex-patriate who runs a nightclub in Casablanca, Morocco during the early stages of WWII. Despite the pressure he constantly receives from the local authorities, Rick's cafe has become a kind of haven for refugees seeking to obtain illicit letters that will help them escape to America. But when Ilsa, a former lover of Rick's, and her husband, show up to his cafe one day, Rick faces a tough challenge which will bring up unforeseen complications, heartbreak and ultimately an excruciating decision to make.",
    "language": "English, French, German, Italian, Russian",
    "country": "United States",
    "poster_url": "https://m.media-amazon.com/images/M/MV5BNWEzN2U1YTYtYTQyMS00NTVkLWE2NGQtZWFlMmM0MDNjMmRiXkEyXkFqcGc@._V1_SX300.jpg",
    "imdb_rating": "8.5"
  },
  {
    "imdb_id": "tt1675434",
    "title": "The Intouchables",
    "year": "2011",
    "rated": "R",
    "runtime": "112 min",
    "genre": "Comedy, Drama",
    "director": "Olivier Nakache, Éric Toledano",
    "actors": "François Cluzet, Omar Sy, Anne Le Ny",
    "plot": "In Paris, the aristocratic and intellectual Philippe is a quadriplegic millionaire who is interviewing candidates for the position of his carer, with his red-haired secretary Magalie. Out of the blue, Driss cuts the line of candidates and brings a document from the Social Security and asks Phillipe to sign it to prove that he is seeking a job position so he can receive his unemployment benefit. Philippe challenges Driss, offering him a trial period of one month to gain experience helping him. Then Driss can decide whether he would like to stay with him or not. Driss accepts the challenge and moves to the mansion, changing the boring life of Phillipe and his employees.",
    "language": "French, English",
    "country": "France",
    "poster_url": "https://m.media-amazon.com/images/M/MV5BMTYxNDA3MDQwNl5BMl5BanBnXkFtZTcwNTU4Mzc1Nw@@._V1_SX300.jpg",
    "imdb_rating": "8.5"
  },
  {
    "imdb_id": "tt0114814",
    "title": "The Usual Suspects",
    "year": "1995",
    "rated": "R",
    "runtime": "106 min",
    "genre": "Crime, Drama, Mystery",
    "director": "Bryan Singer",
    "actors": "Kevin Spacey, Gabriel Byrne, Chazz Palminteri",
    "plot": "Following a truck hijack in New York, five criminals are arrested and brought together for questioning. As none of them are guilty, they plan a revenge operation against the police. The operation goes well, but then the influence of a legendary mastermind criminal called Keyser Söze is felt. It becomes clear that each one of them has wronged Söze at some point and must pay back now. The payback job leaves 27 men dead in a boat explosion, but the real question arises now: Who actually is Keyser Söze?",
    "language": "English, Hungarian, Spanish, French",
    "country": "United States, Germany",
    "poster_url": "https://m.media-amazon.com/images/M/MV5BOTE5MDUxZDUtZWZmZC00NDVmLWFhOGQtNWI2YTc4NzY3MGQ0XkEyXkFqcGc@._V1_SX300.jpg",
    "imdb_rating": "8.5"
  },
  {
    "imdb_id": "tt0078748",
    "title": "Alien",
    "year": "1979",
    "rated": "R",
    "runtime": "117 min",
    "genre": "Horror, Sci-Fi",
    "director": "Ridley Scott",
    "actors": "Sigourney Weaver, Tom Skerritt, John Hurt",
    "plot": "In the distant future, the crew of the commercial spaceship Nostromo are on their way home when they pick up a distress call from a distant moon. The crew are under obligation to investigate and the spaceship descends on the moon afterwards. After a rough landing, three crew members leave the spaceship to explore the area on the moon. At the same time as they discover a hive colony of some unknown creature, the ship's computer deciphers the message to be a warning, not a distress call. When one of the eggs is disturbed, the crew realizes that they are not alone on the spaceship and they must deal with the consequences.",
    "language": "English",
    "country": "United Kingdom, United States",
    "poster_url": "https://m.media-amazon.com/images/M/MV5BN2NhMDk2MmEtZDQzOC00MmY5LThhYzAtMDdjZGFjOGZjMjdjXkEyXkFqcGc@._V1_SX300.jpg",
    "imdb_rating": "8.5"
  },
  {
    "imdb_id": "tt0027977",
    "title": "Modern Times",
    "year": "1936",
    "rated": "G",
    "runtime": "87 min",
    "genre": "Comedy, Drama, Romance",
    "director": "Charles Chaplin",
    "actors": "Charles Chaplin, Paulette Goddard, Henry Bergman",
    "plot": "Chaplin's last 'silent' film, filled with sound effects, was made when everyone else was making talkies. Charlie turns against modern society, the machine age, (The use of sound in films ?) and progress. Firstly we see him frantically trying to keep up with a production line, tightening bolts. He is selected for an experiment with an automatic feeding machine, but various mishaps leads his boss to believe he has gone mad, and Charlie is sent to a mental hospital - When he gets out, he is mistaken for a communist while waving a red flag, sent to jail, foils a jailbreak, and is let out again. We follow Charlie through many more escapades before the film is out.",
    "language": "English",
    "country": "United States",
    "poster_url": "https://m.media-amazon.com/images/M/MV5BODVkZGFhNGQtYjdiYi00Njc4LWFmYTItNTlmNzJjMTg1ZDc5XkEyXkFqcGc@._V1_SX300.jpg",
    "imdb_rating": "8.5"
  },
  {
    "imdb_id": "tt0047396",
    "title": "Rear Window",
    "year": "1954",
    "rated": "PG",
    "runtime": "112 min",
    "genre": "Drama, Mystery, Thriller",
    "director": "Alfred Hitchcock",
    "actors": "James Stewart, Grace Kelly, Wendell Corey",
    "plot": "Professional photographer L.B. \"Jeff\" Jefferies breaks his leg while getting an action shot at an auto race. Confined to his New York apartment, he spends his time looking out of the rear window observing the neighbors. He begins to suspect that a man across the courtyard may have murdered his wife. Jeff enlists the help of his high society fashion-consultant girlfriend Lisa Fremont and his visiting nurse Stella to investigate.",
    "language": "English",
    "country": "United States",
    "poster_url": "https://m.media-amazon.com/images/M/MV5BODZhOWI1ODgtMzdiOS00YjNkLTgwOGUtYmIyZDg5ZmQwMzQ1XkEyXkFqcGc@._V1_SX300.jpg",
    "imdb_rating": "8.5"
  },
  {
    "imdb_id": "tt1853728",
    "title": "Django Unchained",
    "year": "2012",
    "rated": "R",
    "runtime": "165 min",
    "genre": "Drama, Western",
    "director": "Quentin Tarantino",
    "actors": "Jamie Foxx, Christoph Waltz, Leonardo DiCaprio",
    "plot": "In 1858, a bounty-hunter named King Schultz seeks out a slave named Django and buys him because he needs him to find some men he is looking for. After finding them, Django wants to find his wife, Broomhilda, who along with him were sold separately by his former owner for trying to escape. Schultz offers to help him if he chooses to stay with him and be his partner. Eventually they learn that she was sold to a plantation in Mississippi. Knowing they can't just go in and say they want her, they come up with a plan so that the owner will welcome them into his home and they can find a way.",
    "language": "English, German, French, Italian",
    "country": "United States",
    "poster_url": "https://m.media-amazon.com/images/M/MV5BMjIyNTQ5NjQ1OV5BMl5BanBnXkFtZTcwODg1MDU4OA@@._V1_SX300.jpg",
    "imdb_rating": "8.5"
  },
  {
    "imdb_id": "tt0064116",
    "title": "Once Upon a Time in the West",
    "year": "1968",
    "rated": "PG-13",
    "runtime": "166 min",
    "genre": "Drama, Western",
    "director": "Sergio Leone",
    "actors": "Claudia Cardinale, Henry Fonda, Jason Robards",
    "plot": "Jill McBain travels to the wild frontier, Utah, where she and her new husband planned to settle down, but upon arrival, she finds him and his children dead. There's a lot of land, and potential, but there are also those who want to take it--at any cost. Even if it means killing a man and his kids.",
    "language": "English, Spanish, Italian",
    "country": "Italy, United States",
    "poster_url": "https://m.media-amazon.com/images/M/MV5BZjYyNGY1MDEtN2I1MC00MGVhLTljZTYtODQ1NzQ0ODc2NzZlXkEyXkFqcGc@._V1_SX300.jpg",
    "imdb_rating": "8.5"
  },
  {
    "imdb_id": "tt0021749",
    "title": "City Lights",
    "year": "1931",
    "rated": "G",
    "runtime": "87 min",
    "genre": "Comedy, Drama, Romance",
    "director": "Charles Chaplin",
    "actors": "Charles Chaplin, Virginia Cherrill, Florence Lee",
    "plot": "A tramp falls in love with a beautiful blind girl. Her family is in financial trouble. The tramp's on-and-off friendship with a wealthy man allows him to be the girl's benefactor and suitor.",
    "language": "None, English",
    "country": "United States",
    "poster_url": "https://m.media-amazon.com/images/M/MV5BYmMwZDIyZWUtODVhYS00MDRmLTg0N2ItMzU5MGZhN2IxNmZjXkEyXkFqcGc@._V1_SX300.jpg",
    "imdb_rating": "8.5"
  },
  {
    "imdb_id": "tt0078788",
    "title": "Apocalypse Now",
    "year": "1979",
    "rated": "R",
    "runtime": "147 min",
    "genre": "Drama, Mystery, War",
    "director": "Francis Ford Coppola",
    "actors": "Marlon Brando, Martin Sheen, Robert Duvall",
    "plot": "It is the height of the war in Vietnam, and U.S. Army Captain Willard is sent by Colonel Lucas and a General to carry out a mission that, officially, 'does not exist - nor will it ever exist'. The mission: To seek out a mysterious Green Beret Colonel, Walter Kurtz, whose army has crossed the border into Cambodia and is conducting hit-and-run missions against the Viet Cong and NVA. The army believes Kurtz has gone completely insane and Willard's job is to eliminate him. Willard, sent up the Nung River on a U.S. Navy patrol boat, discovers that his target is one of the most decorated officers in the U.S. Army. His crew meets up with surfer-type Lt-Colonel Kilgore, head of a U.S Army helicopter cavalry group which eliminates a Viet Cong outpost to provide an entry point into the Nung River. After some hair-raising encounters, in which some of his crew are killed, Willard, Lance and Chef reach Colonel Kurtz's outpost, beyond the Do Lung Bridge. Now, after becoming prisoners of Kurtz, will Willard &amp; the others be able to fulfill their mission?",
    "language": "English, French, Vietnamese",
    "country": "United States",
    "poster_url": "https://m.media-amazon.com/images/M/MV5BZDhiMTljYjYtODc1Yy00MmEwLTg2OTYtYmE1YTRmNDE4MmEwXkEyXkFqcGc@._V1_SX300.jpg",
    "imdb_rating": "8.4"
  },
  {
    "imdb_id": "tt0910970",
    "title": "WALL·E",
    "year": "2008",
    "rated": "G",
    "runtime": "98 min",
    "genre": "Animation, Adventure, Family",
    "director": "Andrew Stanton",
    "actors": "Ben Burtt, Elissa Knight, Jeff Garlin",
    "plot": "In a distant, but not so unrealistic, future where mankind has abandoned earth because it has become covered with trash from products sold by the powerful multi-national Buy N Large corporation, WALL-E, a garbage collecting robot has been left to clean up the mess. Mesmerized with trinkets of Earth's history and show tunes, WALL-E is alone on Earth except for a sprightly pet cockroach. One day, EVE, a sleek (and dangerous) reconnaissance robot, is sent to Earth to find proof that life is once again sustainable. WALL-E falls in love with EVE. WALL-E rescues EVE from a dust storm and shows her a living plant he found amongst the rubble. Consistent with her \"directive\", EVE takes the plant and automatically enters a deactivated state except for a blinking green beacon. WALL-E, doesn't understand what has happened to his new friend, but, true to his love, he protects her from wind, rain, and lightning, even as she is unresponsive. One day a massive ship comes to reclaim EVE, but WALL-E, out of love or loneliness, hitches a ride on the outside of the ship to rescue EVE. The ship arrives back at a large space cruise ship, which is carrying all of the humans who evacuated Earth 700 years earlier. The people of Earth ride around this space resort on hovering chairs which give them a constant feed of TV and video chatting. They drink all of their meals through a straw out of laziness and/or bone loss, and are all so fat that they can barely move. When the auto-pilot computer, acting on hastily-given instructions sent many centuries before, tries to prevent the people of Earth from returning by stealing the plant, WALL-E, EVE, the portly captain, and a band of broken robots stage a mutiny.",
    "language": "English",
    "country": "United States, Japan",
    "poster_url": "https://m.media-amazon.com/images/M/MV5BMjExMTg5OTU0NF5BMl5BanBnXkFtZTcwMjMxMzMzMw@@._V1_SX300.jpg",
    "imdb_rating": "8.4"
  },
  {
    "imdb_id": "tt0209144",
    "title": "Memento",
    "year": "2000",
    "rated": "R",
    "runtime": "113 min",
    "genre": "Drama, Mystery, Thriller",
    "director": "Christopher Nolan",
    "actors": "Guy Pearce, Carrie-Anne Moss, Joe Pantoliano",
    "plot": "Memento chronicles two separate stories of Leonard, an ex-insurance investigator who can no longer build new memories, as he attempts to find the murderer of his wife, which is the last thing he remembers. One story line moves forward in time while the other tells the story backwards revealing more each time.",
    "language": "English",
    "country": "United States",
    "poster_url": "https://m.media-amazon.com/images/M/MV5BMGQ3Y2Q4NjktN2E4Ny00Y2Q2LTliZDUtZTNiNjRhY2I0NGIyXkEyXkFqcGc@._V1_SX300.jpg",
    "imdb_rating": "8.4"
  },
  {
    "imdb_id": "tt15239678",
    "title": "Dune: Part Two",
    "year": "2024",
    "rated": "PG-13",
    "runtime": "166 min",
    "genre": "Action, Adventure, Drama",
    "director": "Denis Villeneuve",
    "actors": "Timothée Chalamet, Zendaya, Rebecca Ferguson",
    "plot": "Duke Paul Atreides joins the Fremen and begins a spiritual and martial journey to become Muad'dib, while trying to prevent the horrible but inevitable future he's witnessed: a Holy War in his name, spreading throughout the known universe.",
    "language": "English",
    "country": "United States, Canada, United Arab Emirates, Hungary, Italy, New Zealand, Jordan, Gambia",
    "poster_url": "https://m.media-amazon.com/images/M/MV5BNTc0YmQxMjEtODI5MC00NjFiLTlkMWUtOGQ5NjFmYWUyZGJhXkEyXkFqcGc@._V1_SX300.jpg",
    "imdb_rating": "8.4"
  },
  {
    "imdb_id": "tt0082971",
    "title": "Raiders of the Lost Ark",
    "year": "1981",
    "rated": "PG",
    "runtime": "115 min",
    "genre": "Action, Adventure",
    "director": "Steven Spielberg",
    "actors": "Harrison Ford, Karen Allen, Paul Freeman",
    "plot": "The year is 1936. An archeology professor named Indiana Jones is venturing in the jungles of South America searching for a golden statue. Unfortunately, he sets off a deadly trap but miraculously escapes. Then, Jones hears from a museum curator named Marcus Brody about a biblical artifact called The Ark of the Covenant, which can hold the key to human existence. Jones has to venture to vast places such as Nepal and Egypt to find this artifact. However, he will have to fight his enemy Rene Belloq and a band of Nazis in order to reach it.",
    "language": "English, German, Spanish, Nepali, Hebrew, Arabic",
    "country": "United States",
    "poster_url": "https://m.media-amazon.com/images/M/MV5BOGNhMjg2ZjgtYzk4Ni00MTViLTg1MmUtYzM2MDZiYjZlMmU3XkEyXkFqcGc@._V1_SX300.jpg",
    "imdb_rating": "8.4"
  },
  {
    "imdb_id": "tt4154756",
    "title": "Avengers: Infinity War",
    "year": "2018",
    "rated": "PG-13",
    "runtime": "149 min",
    "genre": "Action, Adventure, Sci-Fi",
    "director": "Anthony Russo, Joe Russo",
    "actors": "Robert Downey Jr., Chris Hemsworth, Mark Ruffalo",
    "plot": "As the Avengers and their allies have continued to protect the world from threats too large for any one hero to handle, a new danger has emerged from the cosmic shadows: Thanos. A despot of intergalactic infamy, his goal is to collect all six Infinity Stones, artifacts of unimaginable power, and use them to inflict his twisted will on all of reality. Everything the Avengers have fought for has led up to this moment, the fate of Earth and existence has never been more uncertain.",
    "language": "English",
    "country": "United States, Norway",
    "poster_url": "https://m.media-amazon.com/images/M/MV5BMjMxNjY2MDU1OV5BMl5BanBnXkFtZTgwNzY1MTUwNTM@._V1_SX300.jpg",
    "imdb_rating": "8.4"
  },
  {
    "imdb_id": "tt0405094",
    "title": "The Lives of Others",
    "year": "2006",
    "rated": "R",
    "runtime": "137 min",
    "genre": "Drama, Mystery, Thriller",
    "director": "Florian Henckel von Donnersmarck",
    "actors": "Martina Gedeck, Ulrich Mühe, Sebastian Koch",
    "plot": "Gerd Wiesler is an officer with the Stasi, the East German secret police. The film begins in 1984 when Wiesler attends a play written by Georg Dreyman, who is considered by many to be the ultimate example of the loyal citizen. Wiesler has a gut feeling that Dreyman can't be as ideal as he seems, and believes surveillance is called for. The Minister of Culture agrees but only later does Wiesler learn that the Minister sees Dreyman as a rival and lusts after his partner Christa-Maria. The more time he spends listening in on them, the more he comes to care about them. The once rigid Stasi officer begins to intervene in their lives, in a positive way, protecting them whenever possible. Eventually, Wiesler's activities catch up to him and while there is no proof of wrongdoing, he finds himself in menial jobs - until the unbelievable happens.",
    "language": "German",
    "country": "Germany, France",
    "poster_url": "https://m.media-amazon.com/images/M/MV5BYjM1N2Q0YWEtN2E5MC00NDM3LTk2NTEtMTc1NTk5OTA5ZGIzXkEyXkFqcGc@._V1_SX300.jpg",
    "imdb_rating": "8.4"
  },
  {
    "imdb_id": "tt4633694",
    "title": "Spider-Man: Into the Spider-Verse",
    "year": "2018",
    "rated": "PG",
    "runtime": "117 min",
    "genre": "Animation, Action, Adventure",
    "director": "Bob Persichetti, Peter Ramsey, Rodney Rothman",
    "actors": "Shameik Moore, Jake Johnson, Hailee Steinfeld",
    "plot": "Phil Lord and Christopher Miller, the creative minds behind The Lego Movie and 21 Jump Street, bring their unique talents to a fresh vision of a different Spider-Man Universe, with a groundbreaking visual style that's the first of its kind. \"Spider-Man(TM): Into the Spider-Verse\" introduces Brooklyn teen Miles Morales (Shameik Moore), and the limitless possibilities of the Spider-Verse, where more than one can wear the mask.",
    "language": "English, Spanish",
    "country": "Canada, United States",
    "poster_url": "https://m.media-amazon.com/images/M/MV5BMjMwNDkxMTgzOF5BMl5BanBnXkFtZTgwNTkwNTQ3NjM@._V1_SX300.jpg",
    "imdb_rating": "8.4"
  },
  {
    "imdb_id": "tt0043014",
    "title": "Sunset Boulevard",
    "year": "1950",
    "rated": "Approved",
    "runtime": "110 min",
    "genre": "Drama, Film-Noir",
    "director": "Billy Wilder",
    "actors": "William Holden, Gloria Swanson, Erich von Stroheim",
    "plot": "In Hollywood of the 50's, the obscure screenplay writer Joe Gillis is not able to sell his work to the studios, is full of debts and is thinking in returning to his hometown to work in an office. While trying to escape from his creditors, he has a flat tire and parks his car in a decadent mansion in Sunset Boulevard. He meets the owner and former silent-movie star Norma Desmond, who lives alone with her butler and driver Max Von Mayerling. Norma is demented and believes she will return to the cinema industry, and is protected and isolated from the world by Max, who was her director and husband in the past and still loves her. Norma proposes Joe to move to the mansion and help her in writing a screenplay for her comeback to the cinema, and the small-time writer becomes her lover and gigolo. When Joe falls in love for the young aspirant writer Betty Schaefer, Norma becomes jealous and completely insane and her madness leads to a tragic end.",
    "language": "English",
    "country": "United States",
    "poster_url": "https://m.media-amazon.com/images/M/MV5BMTU0NTkyNzYwMF5BMl5BanBnXkFtZTgwMDU0NDk5MTI@._V1_SX300.jpg",
    "imdb_rating": "8.4"
  },
  {
    "imdb_id": "tt0051201",
    "title": "Witness for the Prosecution",
    "year": "1957",
    "rated": "Approved",
    "runtime": "116 min",
    "genre": "Crime, Drama, Mystery",
    "director": "Billy Wilder",
    "actors": "Tyrone Power, Marlene Dietrich, Charles Laughton",
    "plot": "Ailing barrister Sir Wilfrid Robarts is thrust back into the courtroom in what becomes one of the most unusual and eventful murder case of the lawyer's career when he finds himself defending Leonard Vole, a man being tried for the murder of a wealthy woman. With Robarts choosing to represent him, the two find themselves up against Leonard's cold-hearted wife, Christine - who, in a surprising turn of events, chooses to appear in court against her husband.",
    "language": "English, German",
    "country": "United States",
    "poster_url": "https://m.media-amazon.com/images/M/MV5BNjRhNTQzMzQtMWViMi00ODQ1LTg0MTEtYWE4ZWZlYjM4YjJhXkEyXkFqcGc@._V1_SX300.jpg",
    "imdb_rating": "8.4"
  },
  {
    "imdb_id": "tt0050825",
    "title": "Paths of Glory",
    "year": "1957",
    "rated": "Approved",
    "runtime": "88 min",
    "genre": "Drama, War",
    "director": "Stanley Kubrick",
    "actors": "Kirk Douglas, Ralph Meeker, Adolphe Menjou",
    "plot": "The futility and irony of the war in the trenches in WWI is shown as a unit commander in the French army must deal with the mutiny of his men and a glory-seeking general after part of his force falls back under fire in an impossible attack.",
    "language": "English, German, Latin",
    "country": "United States",
    "poster_url": "https://m.media-amazon.com/images/M/MV5BNmQ2NmI2ODYtMDQzNS00NzQyLTkzZjgtZmZlYTQ5MTc1OWU3XkEyXkFqcGc@._V1_SX300.jpg",
    "imdb_rating": "8.4"
  },
  {
    "imdb_id": "tt0081505",
    "title": "The Shining",
    "year": "1980",
    "rated": "R",
    "runtime": "146 min",
    "genre": "Drama, Horror",
    "director": "Stanley Kubrick",
    "actors": "Jack Nicholson, Shelley Duvall, Danny Lloyd",
    "plot": "Haunted by a persistent writer's block, the aspiring author and recovering alcoholic, Jack Torrance, drags his wife, Wendy, and his gifted son, Danny, up snow-capped Colorado's secluded Overlook Hotel after taking up a job as an off-season caretaker. As the cavernous hotel shuts down for the season, the manager gives Jack a grand tour, and the facility's chef, the ageing Mr Hallorann, has a fascinating chat with Danny about a rare psychic gift called \"The Shining\", making sure to warn him about the hotel's abandoned rooms, and, in particular, the off-limits Room 237. However, instead of overcoming the dismal creative rut, little by little, Jack starts losing his mind, trapped in an unforgiving environment of seemingly endless snowstorms, and a gargantuan silent prison riddled with strange occurrences and eerie visions. Now, the incessant voices inside Jack's head demand sacrifice. Is Jack capable of murder?",
    "language": "English",
    "country": "United Kingdom, United States",
    "poster_url": "https://m.media-amazon.com/images/M/MV5BNmM5ZThhY2ItOGRjOS00NzZiLWEwYTItNDgyMjFkOTgxMmRiXkEyXkFqcGc@._V1_SX300.jpg",
    "imdb_rating": "8.4"
  },
  {
    "imdb_id": "tt0032553",
    "title": "The Great Dictator",
    "year": "1940",
    "rated": "G",
    "runtime": "125 min",
    "genre": "Comedy, Drama, War",
    "director": "Charles Chaplin",
    "actors": "Charles Chaplin, Paulette Goddard, Jack Oakie",
    "plot": "20 years after the end of WWI, in which the nation of Tomainia was on the losing side, Adenoid Hynkel has risen to power as the ruthless dictator of the country. He believes in a pure Aryan state and the decimation of the Jews. This situation is unknown to a simple Jewish Tomainian barber who has been hospitalized since a WWI battle. Upon his release the barber, who had been suffering from memory loss about the war, is shown the new persecuted life of the Jews by many living in the Jewish ghetto, including a washerwoman named Hannah with whom he begins a relationship. The barber is ultimately spared such persecution by Commander Schultz, whom he saved in that WWI battle. The lives of all Jews in Tomainia are eventually spared with a policy shift by Hynkel himself, who is doing so for ulterior motives. But those motives include a desire for world domination, starting with the invasion of neighboring Osterlich, which may be threatened by Benzino Napaloni, the dictator of neighboring Bacteria. Ultimately Schultz, who has turned traitor against Hynkel's regime, and the barber may be able to join forces to take control of the situation, using Schultz's inside knowledge of the regime's workings and the barber's uncanny resemblance to one of those in power.",
    "language": "English, Esperanto, Latin",
    "country": "United States",
    "poster_url": "https://m.media-amazon.com/images/M/MV5BMjc4ZjEwNDUtMjlmZS00NzQ4LTg2N2MtMGI3ZjMyMmM3ZDM2XkEyXkFqcGc@._V1_SX300.jpg",
    "imdb_rating": "8.4"
  },
  {
    "imdb_id": "tt0361748",
    "title": "Inglourious Basterds",
    "year": "2009",
    "rated": "R",
    "runtime": "153 min",
    "genre": "Adventure, Drama, War",
    "director": "Quentin Tarantino",
    "actors": "Brad Pitt, Mélanie Laurent, Christoph Waltz",
    "plot": "In German-occupied France, young Jewish refugee Shosanna Dreyfus witnesses the slaughter of her family by Colonel Hans Landa. Narrowly escaping with her life, she plots her revenge several years later when German war hero Fredrick Zoller takes a rapid interest in her and arranges an illustrious movie premiere at the theater she now runs. With the promise of every major Nazi officer in attendance, the event catches the attention of the \"Basterds\", a group of Jewish-American guerrilla soldiers led by the ruthless Lt. Aldo Raine. As the relentless executioners advance and the conspiring young girl's plans are set in motion, their paths will cross for a fateful evening that will shake the very annals of history.",
    "language": "English, German, French, Italian",
    "country": "United States, Germany",
    "poster_url": "https://m.media-amazon.com/images/M/MV5BODZhMWJlNjYtNDExNC00MTIzLTllM2ItOGQ2NGVjNDQ3MzkzXkEyXkFqcGc@._V1_SX300.jpg",
    "imdb_rating": "8.4"
  },
  {
    "imdb_id": "tt0090605",
    "title": "Aliens",
    "year": "1986",
    "rated": "R",
    "runtime": "137 min",
    "genre": "Action, Adventure, Horror",
    "director": "James Cameron",
    "actors": "Sigourney Weaver, Carrie Henn, Michael Biehn",
    "plot": "57 years after Ellen Ripley had a close encounter with the reptilian alien creature from the first movie, she is called back, this time, to help a group of highly trained colonial marines fight off against the sinister extraterrestrials. But this time, the aliens have taken over a space colony on the moon LV-426. When the colonial marines are called upon to search the deserted space colony, they later find out that they are up against more than what they bargained for. Using specially modified machine guns and enough firepower, it's either fight or die as the space marines battle against the aliens. As the Marines do their best to defend themselves, Ripley must attempt to protect a young girl who is the sole survivor of the nearly wiped out space colony.",
    "language": "English, Spanish",
    "country": "United Kingdom, United States",
    "poster_url": "https://m.media-amazon.com/images/M/MV5BZjIyNGJhYzYtN2I1My00OTVhLWEyMzItZTVjNDMzOTVkYWViXkEyXkFqcGc@._V1_SX300.jpg",
    "imdb_rating": "8.4"
  },
  {
    "imdb_id": "tt23849204",
    "title": "12th Fail",
    "year": "2023",
    "rated": "",
    "runtime": "147 min",
    "genre": "Biography, Drama",
    "director": "Vidhu Vinod Chopra",
    "actors": "Vikrant Massey, Medha Shankr, Anant Joshi",
    "plot": "The real-life story of IPS Officer Manoj Kumar Sharma and IRS Officer Shraddha Joshi.",
    "language": "Hindi, English",
    "country": "India",
    "poster_url": "https://m.media-amazon.com/images/M/MV5BNTE3OTIxZDYtNjA0NC00N2YxLTg1NGQtOTYxNmZkMDkwOWNjXkEyXkFqcGc@._V1_SX300.jpg",
    "imdb_rating": "8.7"
  },
  {
    "imdb_id": "tt0057565",
    "title": "High and Low",
    "year": "1963",
    "rated": "Not Rated",
    "runtime": "143 min",
    "genre": "Crime, Drama, Mystery",
    "director": "Akira Kurosawa",
    "actors": "Toshirô Mifune, Yutaka Sada, Tatsuya Nakadai",
    "plot": "A wealthy businessman is told his son has been kidnapped and he will have to pay a very large sum for him to be returned safely. It is then discovered that his son is safe at home: the kidnapper took his chauffeur's son by accident. The kidnapper says this makes no difference: pay up or the child dies. This leaves him with a moral dilemma, as he really needs the money to conclude a very important business deal.",
    "language": "Japanese",
    "country": "Japan",
    "poster_url": "https://m.media-amazon.com/images/M/MV5BMGJiNzllYjktODAzNS00OGUzLTlmY2MtMjA2ZTZhYTY1OTc4XkEyXkFqcGc@._V1_SX300.jpg",
    "imdb_rating": "8.4"
  },
  {
    "imdb_id": "tt1345836",
    "title": "The Dark Knight Rises",
    "year": "2012",
    "rated": "PG-13",
    "runtime": "164 min",
    "genre": "Action, Crime, Drama",
    "director": "Christopher Nolan",
    "actors": "Christian Bale, Tom Hardy, Anne Hathaway",
    "plot": "Despite his tarnished reputation after the events of The Dark Knight (2008), in which he took the rap for Dent's crimes, Batman feels compelled to intervene to assist the city and its Police force, which is struggling to cope with Bane's plans to destroy the city.",
    "language": "English, Arabic",
    "country": "United States, United Kingdom",
    "poster_url": "https://m.media-amazon.com/images/M/MV5BMTk4ODQzNDY3Ml5BMl5BanBnXkFtZTcwODA0NTM4Nw@@._V1_SX300.jpg",
    "imdb_rating": "8.4"
  },
  {
    "imdb_id": "tt2380307",
    "title": "Coco",
    "year": "2017",
    "rated": "PG",
    "runtime": "105 min",
    "genre": "Animation, Adventure, Drama",
    "director": "Lee Unkrich, Adrian Molina",
    "actors": "Anthony Gonzalez, Gael García Bernal, Benjamin Bratt",
    "plot": "Despite his family's baffling generations-old ban on music, Miguel dreams of becoming an accomplished musician like his idol, Ernesto de la Cruz. Desperate to prove his talent, Miguel finds himself in the stunning and colorful Land of the Dead following a mysterious chain of events. Along the way, he meets charming trickster Hector, and together, they set off on an extraordinary journey to unlock the real story behind Miguel's family history.",
    "language": "English, Spanish",
    "country": "United States, Mexico",
    "poster_url": "https://m.media-amazon.com/images/M/MV5BMDIyM2E2NTAtMzlhNy00ZGUxLWI1NjgtZDY5MzhiMDc5NGU3XkEyXkFqcGc@._V1_SX300.jpg",
    "imdb_rating": "8.4"
  },
  {
    "imdb_id": "tt4154796",
    "title": "Avengers: Endgame",
    "year": "2019",
    "rated": "PG-13",
    "runtime": "181 min",
    "genre": "Action, Adventure, Sci-Fi",
    "director": "Anthony Russo, Joe Russo",
    "actors": "Robert Downey Jr., Chris Evans, Mark Ruffalo",
    "plot": "After the devastating events of Avengers: Infinity War (2018), the universe is in ruins due to the efforts of the Mad Titan, Thanos. With the help of remaining allies, the Avengers must assemble once more in order to undo Thanos's actions and undo the chaos to the universe, no matter what consequences may be in store, and no matter who they face...",
    "language": "English, Japanese, Xhosa, German",
    "country": "United States",
    "poster_url": "https://m.media-amazon.com/images/M/MV5BMTc5MDE2ODcwNV5BMl5BanBnXkFtZTgwMzI2NzQ2NzM@._V1_SX300.jpg",
    "imdb_rating": "8.4"
  },
  {
    "imdb_id": "tt0086879",
    "title": "Amadeus",
    "year": "1984",
    "rated": "PG",
    "runtime": "160 min",
    "genre": "Biography, Drama, Music",
    "director": "Milos Forman",
    "actors": "F. Murray Abraham, Tom Hulce, Elizabeth Berridge",
    "plot": "Antonio Salieri believes that Wolfgang Amadeus Mozart's music is divine and miraculous. He wishes he was himself as good a musician as Mozart so that he can praise the Lord through composing. He began his career as a devout man who believes his success and talent as a composer are God's rewards for his piety. He's also content as the respected, financially well-off, court composer of Austrian Emperor Joseph II. But he's shocked to learn that Mozart is such a vulgar creature, and can't understand why God favored Mozart to be his instrument. Salieri's envy has made him an enemy of God whose greatness was evident in Mozart. He is ready to take revenge against God and Mozart for his own musical mediocrity.",
    "language": "English, Italian, Latin, German, French",
    "country": "United States, France",
    "poster_url": "https://m.media-amazon.com/images/M/MV5BMzc2MjM0NTMtOGY4NC00NzY1LWE2ODUtZjMzY2RhNGNkZDAyXkEyXkFqcGc@._V1_SX300.jpg",
    "imdb_rating": "8.4"
  },
  {
    "imdb_id": "tt0119217",
    "title": "Good Will Hunting",
    "year": "1997",
    "rated": "R",
    "runtime": "126 min",
    "genre": "Drama, Romance",
    "director": "Gus Van Sant",
    "actors": "Matt Damon, Ben Affleck, Stellan Skarsgård",
    "plot": "A touching tale of a wayward young man who struggles to find his identity, living in a world where he can solve any problem, except the one brewing deep within himself, until one day he meets his soul mate who opens his mind and his heart.",
    "language": "English",
    "country": "United States",
    "poster_url": "https://m.media-amazon.com/images/M/MV5BNDdjZGQ5YzEtNTc2My00Mjc0LWFlMTctYzkwMzZlNzdiZWYzXkEyXkFqcGc@._V1_SX300.jpg",
    "imdb_rating": "8.3"
  },
  {
    "imdb_id": "tt0114709",
    "title": "Toy Story",
    "year": "1995",
    "rated": "G",
    "runtime": "81 min",
    "genre": "Animation, Adventure, Comedy",
    "director": "John Lasseter",
    "actors": "Tom Hanks, Tim Allen, Don Rickles",
    "plot": "A little boy named Andy loves to be in his room, playing with his toys, especially his doll named \"Woody\". But, what do the toys do when Andy is not with them, they come to life. Woody believes that his life (as a toy) is good. However, he must worry about Andy's family moving, and what Woody does not know is about Andy's birthday party. Woody does not realize that Andy's mother gave him an action figure known as Buzz Lightyear, who does not believe that he is a toy, and quickly becomes Andy's new favorite toy. Woody, who is now consumed with jealousy, tries to get rid of Buzz. Then, both Woody and Buzz are now lost. They must find a way to get back to Andy before he moves without them, but they will have to pass through a ruthless toy killer, Sid Phillips.",
    "language": "English",
    "country": "United States",
    "poster_url": "https://m.media-amazon.com/images/M/MV5BZTA3OWVjOWItNjE1NS00NzZiLWE1MjgtZDZhMWI1ZTlkNzYwXkEyXkFqcGc@._V1_SX300.jpg",
    "imdb_rating": "8.3"
  },
  {
    "imdb_id": "tt5311514",
    "title": "Your Name.",
    "year": "2016",
    "rated": "TV-PG",
    "runtime": "106 min",
    "genre": "Animation, Drama, Fantasy",
    "director": "Makoto Shinkai",
    "actors": "Ryûnosuke Kamiki, Mone Kamishiraishi, Ryo Narita",
    "plot": "Mitsuha is the daughter of the mayor of a small mountain town. She's a straightforward high school girl who lives with her sister and her grandmother and has no qualms about letting it be known that she's uninterested in Shinto rituals or helping her father's electoral campaign. Instead she dreams of leaving the boring town and trying her luck in Tokyo. Taki is a high school boy in Tokyo who works part-time in an Italian restaurant and aspires to become an architect or an artist. Every night he has a strange dream where he becomes...a high school girl in a small mountain town.",
    "language": "Japanese",
    "country": "Japan",
    "poster_url": "https://m.media-amazon.com/images/M/MV5BMjI1ODZkYTgtYTY3Yy00ZTJkLWFkOTgtZDUyYWM4MzQwNjk0XkEyXkFqcGc@._V1_SX300.jpg",
    "imdb_rating": "8.4"
  },
  {
    "imdb_id": "tt0082096",
    "title": "Das Boot",
    "year": "1981",
    "rated": "R",
    "runtime": "149 min",
    "genre": "Drama, War",
    "director": "Wolfgang Petersen",
    "actors": "Jürgen Prochnow, Herbert Grönemeyer, Klaus Wennemann",
    "plot": "It is 1942 and the German submarine fleet is heavily engaged in the so-called \"Battle of the Atlantic\" to harass and destroy British shipping. With better escorts of the destroyer class, however, German U-boats have begun to take heavy losses. \"Das Boot\" is the story of the crew of one such U-Boat, with the film examining how these submariners maintained their professionalism as soldiers and attempted to accomplish impossible missions, all the while attempting to understand and obey the ideology of the government under which they served.",
    "language": "German, English, French",
    "country": "West Germany",
    "poster_url": "https://m.media-amazon.com/images/M/MV5BNGU0MWZlMTUtM2Y3Ny00NGNmLWE5NmEtN2YxOWQzMGM3ZWYzXkEyXkFqcGc@._V1_SX300.jpg",
    "imdb_rating": "8.4"
  },
  {
    "imdb_id": "tt0364569",
    "title": "Oldboy",
    "year": "2003",
    "rated": "R",
    "runtime": "120 min",
    "genre": "Action, Drama, Mystery",
    "director": "Park Chan-wook",
    "actors": "Choi Min-sik, Yoo Ji-tae, Kang Hye-jeong",
    "plot": "Abducted on a rainy night in 1988, the obnoxious drunk, Oh Dae-Su, much to his surprise, wakes up locked in a windowless and dilapidated hotel room, for an unknown reason. There, his invisible and pitiless captors will feed him, clothe him, and sedate him to avert a desperate suicide--and as his only companion and a window to the world is the TV in his stark cell--the only thing that helps Oh Dae-Su keep going is his daily journal. Then, unexpectedly, after fifteen long years in captivity, the perplexed prisoner is deliberately released, encouraged to track down his tormentor to finally get his retribution. However, who would hate Oh Dae-Su so much he would deny him of a quick and clean death?",
    "language": "Korean",
    "country": "South Korea",
    "poster_url": "https://m.media-amazon.com/images/M/MV5BMTAwNzNjYWItZmI0Ni00ZTcyLWIwNWMtZjlmNGMxZTEyYTJmXkEyXkFqcGc@._V1_SX300.jpg",
    "imdb_rating": "8.3"
  },
  {
    "imdb_id": "tt0057012",
    "title": "Dr. Strangelove or: How I Learned to Stop Worrying and Love the Bomb",
    "year": "1964",
    "rated": "PG",
    "runtime": "95 min",
    "genre": "Comedy, War",
    "director": "Stanley Kubrick",
    "actors": "Peter Sellers, George C. Scott, Sterling Hayden",
    "plot": "Paranoid Brigadier General Jack D. Ripper of Burpelson Air Force Base, believing that fluoridation of the American water supply is a Soviet plot to poison the U.S. populace, is able to deploy through a back door mechanism a nuclear attack on the Soviet Union without the knowledge of his superiors, including the Chair of the Joint Chiefs of Staff, General Buck Turgidson, and President Merkin Muffley. Only Ripper knows the code to recall the B-52 bombers and he has shut down communication in and out of Burpelson as a measure to protect this attack. Ripper's executive officer, RAF Group Captain Lionel Mandrake (on exchange from Britain), who is being held at Burpelson by Ripper, believes he knows the recall codes if he can only get a message to the outside world. Meanwhile at the Pentagon War Room, key persons including Muffley, Turgidson and nuclear scientist and adviser, a former Nazi named Dr. Strangelove, are discussing measures to stop the attack or mitigate its blow-up into an all out nuclear war with the Soviets. Against Turgidson's wishes, Muffley brings Soviet Ambassador Alexi de Sadesky into the War Room, and get his boss, Soviet Premier Dimitri Kisov, on the hot line to inform him of what's going on. The Americans in the War Room are dismayed to learn that the Soviets have an as yet unannounced Doomsday Device to detonate if any of their key targets are hit. As Ripper, Mandrake and those in the War Room try and work the situation to their end goal, Major T.J. \"King\" Kong, one of the B-52 bomber pilots, is working on his own agenda of deploying his bomb where ever he can on enemy soil if he can't make it to his intended target.",
    "language": "English, Russian",
    "country": "United Kingdom, United States",
    "poster_url": "https://m.media-amazon.com/images/M/MV5BMjFjYzBlOTktMTI2OS00ZWVhLTgxMDUtNzAwODY2NmI3YTAzXkEyXkFqcGc@._V1_SX300.jpg",
    "imdb_rating": "8.3"
  },
  {
    "imdb_id": "tt0112573",
    "title": "Braveheart",
    "year": "1995",
    "rated": "R",
    "runtime": "178 min",
    "genre": "Biography, Drama, War",
    "director": "Mel Gibson",
    "actors": "James Robinson, Sean Lawlor, Sandy Nelson",
    "plot": "William Wallace is a Scottish rebel who leads an uprising against the cruel English ruler Edward the Longshanks, who wishes to inherit the crown of Scotland for himself. When he was a young boy, William Wallace's father and brother, along with many others, lost their lives trying to free Scotland. Once he loses another of his loved ones, William Wallace begins his long quest to make Scotland free once and for all, along with the assistance of Robert the Bruce.",
    "language": "English, French, Latin, Gaelic, Italian",
    "country": "United States",
    "poster_url": "https://m.media-amazon.com/images/M/MV5BNGMxZDBhNGQtYTZlNi00N2UzLWI4NDEtNmUzNWM2NTdmZDA0XkEyXkFqcGc@._V1_SX300.jpg",
    "imdb_rating": "8.3"
  },
  {
    "imdb_id": "tt0119698",
    "title": "Princess Mononoke",
    "year": "1997",
    "rated": "PG-13",
    "runtime": "133 min",
    "genre": "Animation, Adventure, Fantasy",
    "director": "Hayao Miyazaki",
    "actors": "Yôji Matsuda, Yuriko Ishida, Yûko Tanaka",
    "plot": "While protecting his village from rampaging boar-god/demon, a confident young warrior, Ashitaka, is stricken by a deadly curse. To save his life, he must journey to the forests of the west. Once there, he's embroiled in a fierce campaign that humans were waging on the forest. The ambitious Lady Eboshi and her loyal clan use their guns against the gods of the forest and a brave young woman, Princess Mononoke, who was raised by a wolf-god. Ashitaka sees the good in both sides and tries to stem the flood of blood. This is met by animosity by both sides as they each see him as supporting the enemy.",
    "language": "Japanese",
    "country": "Japan",
    "poster_url": "https://m.media-amazon.com/images/M/MV5BZTcyN2Y0MDYtMGI1NC00MWQ1LWFhZGMtN2U4NTcxZGYyNjljXkEyXkFqcGc@._V1_SX300.jpg",
    "imdb_rating": "8.3"
  },
  {
    "imdb_id": "tt0169547",
    "title": "American Beauty",
    "year": "1999",
    "rated": "R",
    "runtime": "122 min",
    "genre": "Drama",
    "director": "Sam Mendes",
    "actors": "Kevin Spacey, Annette Bening, Thora Birch",
    "plot": "After his death sometime in his 43rd year, suburbanite Lester Burnham tells of the last few weeks of his life, during which he had no idea of his imminent passing. He is a husband to real estate agent Carolyn Burnham and father to high school student Jane Burnham. Although Lester and Carolyn once loved each other, they now merely tolerate each other. Typical wallflower Jane also hates both her parents; the three suffer individually in silence in their home life. Jane tries to steer clear of both her parents. Carolyn, relatively new to the real estate business, wants to create the persona of success to further her career, aspiring to the professional life of Buddy Kane, the king of the real estate business in their neighborhood. Lester merely walks mindlessly through life, including at his job in advertising. His company is downsizing, and he, like all the other employees, has to justify his position to the newly hired efficiency expert to keep his job. Things change for Lester when he falls in love at first sight with Jane's more experienced classmate, Angela Hayes. Both Janie and Angela can see Lester's sexual infatuation with Angela, who courts such attention from any man as a sign that she is model material, she having once appeared in Seventeen and is a career to which she aspires. Lester's infatuation with Angela gives him a reenergized view on life, where he openly doesn't care anymore what anyone thinks about what he does, anyone except Angela. This infatuation coincides with the Fittses moving in next door: homophobic disciplinarian US Marine Colonel Frank Fitts who rules the house with a military fist (that fist being both figurative and literal), his semi-comatose wife Barbara Fitts, and their bright and quietly subversive 18-year-old son Ricky Fitts, who openly abides by his father's rules while behind the scenes lives by his own quite different perspective. Much like Lester's infatuation, Ricky immediately becomes infatuated with Jane; he considers girls like Angela as ordinary. The entry of Angela and the Fittses into the Burnhams' lives ultimately leads to each of the players confronting what is truly in his or her heart.",
    "language": "English",
    "country": "United States",
    "poster_url": "https://m.media-amazon.com/images/M/MV5BMDI1MDE0OTMtMmI2MS00Yjc2LTg2MTItMWExYTg5NzA1OGUzXkEyXkFqcGc@._V1_SX300.jpg",
    "imdb_rating": "8.3"
  },
  {
    "imdb_id": "tt1187043",
    "title": "3 Idiots",
    "year": "2009",
    "rated": "PG-13",
    "runtime": "170 min",
    "genre": "Comedy, Drama",
    "director": "Rajkumar Hirani",
    "actors": "Aamir Khan, Madhavan, Mona Singh",
    "plot": "Farhan Qureshi and Raju Rastogi want to re-unite with their fellow collegian, Rancho, after faking a stroke aboard an Air India plane, and excusing himself from his wife - trouser less - respectively. Enroute, they encounter another student, Chatur Ramalingam, now a successful businessman, who reminds them of a bet they had undertaken 10 years ago. The trio, while recollecting hilarious antics, including their run-ins with the Dean of Delhi's Imperial College of Engineering, Viru Sahastrabudhe, race to locate Rancho, at his last known address - little knowing the secret that was kept from them all this time.",
    "language": "Hindi, English",
    "country": "India",
    "poster_url": "https://m.media-amazon.com/images/M/MV5BNzc4ZWQ3NmYtODE0Ny00YTQ4LTlkZWItNTBkMGQ0MmUwMmJlXkEyXkFqcGc@._V1_SX300.jpg",
    "imdb_rating": "8.4"
  },
  {
    "imdb_id": "tt8267604",
    "title": "Capernaum",
    "year": "2018",
    "rated": "R",
    "runtime": "126 min",
    "genre": "Drama",
    "director": "Nadine Labaki",
    "actors": "Zain Al Rafeea, Yordanos Shiferaw, Boluwatife Treasure Bankole",
    "plot": "Capernaüm (\"Chaos\") tells the story of Zain (Zain al-Rafeea), a Lebanese boy who sues his parents for the \"crime\" of giving him life. The film follows Zain as he journeys from gutsy, streetwise child to hardened 12-year-old \"adult\" fleeing his negligent parents, surviving through his wits on the streets, where he meets Ethiopian migrant worker Rahil, who provides him with shelter and food, as Zain takes care of her baby son Yonas in return. Zain later gets jailed for committing a violent crime, and finally seeks justice in a courtroom.",
    "language": "Arabic, Amharic",
    "country": "Lebanon, United States, France, Cyprus, Qatar, United Kingdom",
    "poster_url": "https://m.media-amazon.com/images/M/MV5BYzEyMzQ1OTktZTljZi00OWQzLWE2ZmUtZjQyNzBjYjE1NTc0XkEyXkFqcGc@._V1_SX300.jpg",
    "imdb_rating": "8.4"
  },
  {
    "imdb_id": "tt7286456",
    "title": "Joker",
    "year": "2019",
    "rated": "R",
    "runtime": "122 min",
    "genre": "Crime, Drama, Thriller",
    "director": "Todd Phillips",
    "actors": "Joaquin Phoenix, Robert De Niro, Zazie Beetz",
    "plot": "Arthur Fleck works as a clown and is an aspiring stand-up comic. He has mental health issues, part of which involves uncontrollable laughter. Times are tough and, due to his issues and occupation, Arthur has an even worse time than most. Over time these issues bear down on him, shaping his actions, making him ultimately take on the persona he is more known as...Joker.",
    "language": "English, German",
    "country": "United States, Canada, Australia",
    "poster_url": "https://m.media-amazon.com/images/M/MV5BNzY3OWQ5NDktNWQ2OC00ZjdlLThkMmItMDhhNDk3NTFiZGU4XkEyXkFqcGc@._V1_SX300.jpg",
    "imdb_rating": "8.3"
  },
  {
    "imdb_id": "tt0087843",
    "title": "Once Upon a Time in America",
    "year": "1984",
    "rated": "R",
    "runtime": "229 min",
    "genre": "Crime, Drama",
    "director": "Sergio Leone",
    "actors": "Robert De Niro, James Woods, Elizabeth McGovern",
    "plot": "With the vivid memory of his long-gone childhood friends Max, Patsy, and Cockeye etched in his mind, his ferociously loyal partners-in-crime during their rise to prominence in New York's Prohibition-era Lower East Side, the defeated, penniless, and guilt-ridden former gangster David \"Noodles\" Aaronson returns to Manhattan. Not knowing what to expect on his mission to shed light on his opaque past, grizzled Noodles reunites with his only living friend Fat Moe after 35 haunted years of self-exile. However, the relentless, piercing sound of culpability stands in the way of finding closure, as the inscrutable content of a well-worn leather suitcase further complicates matters. And now, against the backdrop of a torn conscience, the sad, bittersweet recollections of more than 50 years of love, death, and everything in-between become inextricably intertwined, leading to even more puzzling questions. But what are a man's options when he is left with nothing?",
    "language": "English, Italian, French, Yiddish, Hebrew",
    "country": "Italy, United States",
    "poster_url": "https://m.media-amazon.com/images/M/MV5BMDQ0ZTg2OGUtZjMyOC00M2M5LThkMmItZmM2MmUzMmIxMWJhXkEyXkFqcGc@._V1_SX300.jpg",
    "imdb_rating": "8.3"
  },
  {
    "imdb_id": "tt0045152",
    "title": "Singin' in the Rain",
    "year": "1952",
    "rated": "G",
    "runtime": "103 min",
    "genre": "Comedy, Musical, Romance",
    "director": "Stanley Donen, Gene Kelly",
    "actors": "Gene Kelly, Donald O'Connor, Debbie Reynolds",
    "plot": "1927 Hollywood. Monumental Pictures' biggest stars, glamorous on-screen couple Lina Lamont and Don Lockwood, are also an off-screen couple if the trade papers and gossip columns are to be believed. Both perpetuate the public perception if only to please their adoring fans and bring people into the movie theaters. In reality, Don barely tolerates her, while Lina, despite thinking Don beneath her, simplemindedly believes what she sees on screen in order to bolster her own stardom and sense of self-importance. R.F. Simpson, Monumental's head, dismisses what he thinks is a flash in the pan: talking pictures. It isn't until The Jazz Singer (1927) becomes a bona fide hit which results in all the movie theaters installing sound equipment that R.F. knows Monumental, most specifically in the form of Don and Lina, have to jump on the talking picture bandwagon, despite no one at the studio knowing anything about the technology. Musician Cosmo Brown, Don's best friend, gets hired as Monumental's ideas man and musical director. And by this time, Don has secretly started dating Kathy Selden, a chorus girl who is trying to make it big in pictures herself. Don and Kathy's relationship is despite their less than friendly initial meeting. Cosmo and Kathy help Don, who had worked his way up through the movie ranks to stardom, try make the leap to talking picture stardom, with Kathy following along the way. However, they have to overcome the technological issues. But the bigger problem is Lina, who will do anything to ensure she also makes the successful leap into talking pictures, despite her own inabilities and at anyone and everyone else's expense if they get in her way, especially Kathy as Don's off screen girlfriend and possibly his new talking picture leading lady.",
    "language": "English",
    "country": "United States",
    "poster_url": "https://m.media-amazon.com/images/M/MV5BMGQzZDFjZWUtZDU4ZS00ZjM3LTgyYmItYjA3YmIwYzRkZWY3XkEyXkFqcGc@._V1_SX300.jpg",
    "imdb_rating": "8.3"
  },
  {
    "imdb_id": "tt0091251",
    "title": "Come and See",
    "year": "1985",
    "rated": "Not Rated",
    "runtime": "142 min",
    "genre": "Drama, Thriller, War",
    "director": "Elem Klimov",
    "actors": "Aleksey Kravchenko, Olga Mironova, Liubomiras Laucevicius",
    "plot": "The feature film directed by Elem Klimov, shot in the genre of military drama. The action takes place on the territory of Belarus in 1943. In the center of the story is a Belarusian boy, who witnesses the horrors of the Nazi punitive action, turning from a cheerful teenager into a gray-haired old man for two days.",
    "language": "Belarusian, Russian, German",
    "country": "Soviet Union",
    "poster_url": "https://m.media-amazon.com/images/M/MV5BNDlkZmVkZDAtZGFmMS00OWIzLWJkY2YtNWE5NjNhNjhiZGE3XkEyXkFqcGc@._V1_SX300.jpg",
    "imdb_rating": "8.3"
  },
  {
    "imdb_id": "tt0180093",
    "title": "Requiem for a Dream",
    "year": "2000",
    "rated": "NC-17",
    "runtime": "102 min",
    "genre": "Drama",
    "director": "Darren Aronofsky",
    "actors": "Ellen Burstyn, Jared Leto, Jennifer Connelly",
    "plot": "Sara Goldfarb (Ellen Burstyn) is a retired widow, living in a small apartment. She spends most of her time watching TV, especially a particular self-help show. She has delusions of rising above her current dull existence by being a guest on that show. Her son, Harry (Jared Leto) is a junkie but along with his friend Tyrone (Marlon Wayans) has visions of making it big by becoming a drug dealer. Harry's girlfriend Marion (Jennifer Connelly) could be fashion designer or artist but is swept along in Harry's drug-centric world. Meanwhile Sara has developed an addiction of her own. She desperately wants to lose weight and so goes on a crash course involving popping pills, pills which turn out to be very addictive and harmful to her mental state.",
    "language": "English",
    "country": "United States",
    "poster_url": "https://m.media-amazon.com/images/M/MV5BN2ZlMjIzZjctYzA2My00ZWYyLWI4ZjctMGI2NWYyNzFiZjAwXkEyXkFqcGc@._V1_SX300.jpg",
    "imdb_rating": "8.3"
  },
  {
    "imdb_id": "tt0086190",
    "title": "Star Wars: Episode VI - Return of the Jedi",
    "year": "1983",
    "rated": "PG",
    "runtime": "131 min",
    "genre": "Action, Adventure, Fantasy",
    "director": "Richard Marquand",
    "actors": "Mark Hamill, Harrison Ford, Carrie Fisher",
    "plot": "Luke Skywalker battles Jabba the Hutt and Darth Vader to save his comrades in the Rebel Alliance and triumph over the Galactic Empire. Han Solo and Princess Leia reaffirm their love, and team with Chewbacca, Lando Calrissian, the Ewoks, and droids C-3PO and R2-D2 to aid in the disruption of the Dark Side, and the defeat of the evil emperor.",
    "language": "English, Kikuyu, Tagalog, Kalmyk-Oirat, Quechua, Polish",
    "country": "United States",
    "poster_url": "https://m.media-amazon.com/images/M/MV5BNWEwOTI0MmUtMGNmNy00ODViLTlkZDQtZTg1YmQ3MDgyNTUzXkEyXkFqcGc@._V1_SX300.jpg",
    "imdb_rating": "8.3"
  },
  {
    "imdb_id": "tt0435761",
    "title": "Toy Story 3",
    "year": "2010",
    "rated": "G",
    "runtime": "103 min",
    "genre": "Animation, Adventure, Comedy",
    "director": "Lee Unkrich",
    "actors": "Tom Hanks, Tim Allen, Joan Cusack",
    "plot": "Woody, Buzz and the whole gang are back. As their owner Andy prepares to depart for college, his loyal toys find themselves in daycare where untamed tots with their sticky little fingers do not play nice. So, it's all for one and one for all as they join Barbie's counterpart Ken, a thespian hedgehog named Mr. Pricklepants and a pink, strawberry-scented teddy bear called Lots-o'-Huggin' Bear to plan their great escape.",
    "language": "English, Spanish",
    "country": "United States",
    "poster_url": "https://m.media-amazon.com/images/M/MV5BMTgxOTY4Mjc0MF5BMl5BanBnXkFtZTcwNTA4MDQyMw@@._V1_SX300.jpg",
    "imdb_rating": "8.3"
  },
  {
    "imdb_id": "tt2106476",
    "title": "The Hunt",
    "year": "2012",
    "rated": "R",
    "runtime": "115 min",
    "genre": "Drama",
    "director": "Thomas Vinterberg",
    "actors": "Mads Mikkelsen, Thomas Bo Larsen, Annika Wedderkopp",
    "plot": "Lucas is a Kindergarten teacher who takes great care of his students. Unfortunately for him, young Klara has a run-away imagination and concocts a lie about her teacher. Before Lucas is even able to understand the consequences, he has become the outcast of the town. The hunt is on to prove his innocence before it's taken from him for good.",
    "language": "Danish, English, Polish",
    "country": "Denmark, Sweden, Belgium, France",
    "poster_url": "https://m.media-amazon.com/images/M/MV5BMTg2NDg3ODg4NF5BMl5BanBnXkFtZTcwNzk3NTc3Nw@@._V1_SX300.jpg",
    "imdb_rating": "8.3"
  },
  {
    "imdb_id": "tt0044741",
    "title": "Ikiru",
    "year": "1952",
    "rated": "Not Rated",
    "runtime": "143 min",
    "genre": "Drama",
    "director": "Akira Kurosawa",
    "actors": "Takashi Shimura, Nobuo Kaneko, Shin'ichi Himori",
    "plot": "Kanji Watanabe is a civil servant. He has worked in the same department for 30 years. His life is pretty boring and monotonous, though he once used to have passion and drive. Then one day he discovers that he has stomach cancer and has less than a year to live. After the initial depression he sets about living for the first time in over 20 years. Then he realises that his limited time left is not just for living life to the full but to leave something meaningful behind...",
    "language": "Japanese, Latin, English, French",
    "country": "Japan",
    "poster_url": "https://m.media-amazon.com/images/M/MV5BMmNlZTk4ZjQtY2I5NS00NmNiLTlkNmUtYTc3YmE0ZTk3OGNiXkEyXkFqcGc@._V1_SX300.jpg",
    "imdb_rating": "8.3"
  },
  {
    "imdb_id": "tt0338013",
    "title": "Eternal Sunshine of the Spotless Mind",
    "year": "2004",
    "rated": "R",
    "runtime": "108 min",
    "genre": "Drama, Romance, Sci-Fi",
    "director": "Michel Gondry",
    "actors": "Jim Carrey, Kate Winslet, Tom Wilkinson",
    "plot": "Much to his surprise, timid Joel Barish is shocked to discover that the love of his life, sparky Clementine, has had him erased from her memory. To pay her back in the same coin, poor Joel summons up the courage to undergo a painless but intricate medical procedure to do the same, utterly unaware that darkness is an essential part of the light. Now, as hurt and angry Joel's ugly recollections of Clementine gradually fade away, giving way to a soulless black void, suddenly, he begins having second thoughts, toying with the idea of stopping the irreversible process. In the end, is ignorance really bliss?",
    "language": "English",
    "country": "United States",
    "poster_url": "https://m.media-amazon.com/images/M/MV5BMTY4NzcwODg3Nl5BMl5BanBnXkFtZTcwNTEwOTMyMw@@._V1_SX300.jpg",
    "imdb_rating": "8.3"
  },
  {
    "imdb_id": "tt1255953",
    "title": "Incendies",
    "year": "2010",
    "rated": "R",
    "runtime": "131 min",
    "genre": "Drama, Mystery, War",
    "director": "Denis Villeneuve",
    "actors": "Mustafa Kamel, Hussein Sami, Rémy Girard",
    "plot": "A mother's last wishes send twins Jeanne and Simon on a journey to the Middle East in search of their tangled roots. Adapted from Wajdi Mouawad's acclaimed play, Incendies tells the powerful and moving tale of two young adults' voyage to the core of deep-rooted hatred, never-ending wars and enduring love.",
    "language": "French, Arabic, English",
    "country": "Canada, France",
    "poster_url": "https://m.media-amazon.com/images/M/MV5BYWFmMjdmNjctNzhhOC00ZmMzLTkwOGItMmVmZDU4MjE2MTYwXkEyXkFqcGc@._V1_SX300.jpg",
    "imdb_rating": "8.3"
  },
  {
    "imdb_id": "tt0053604",
    "title": "The Apartment",
    "year": "1960",
    "rated": "Approved",
    "runtime": "125 min",
    "genre": "Comedy, Drama, Romance",
    "director": "Billy Wilder",
    "actors": "Jack Lemmon, Shirley MacLaine, Fred MacMurray",
    "plot": "As of November 1, 1959, mild mannered C.C. Baxter has been working at Consolidated Life, an insurance company, for close to four years, and is one of close to thirty-two thousand employees located in their Manhattan head office. To distinguish himself from all the other lowly cogs in the company in the hopes of moving up the corporate ladder, he often works late, but only because he can't get into his apartment, located off of Central Park West, since he has provided it to a handful of company executives - Mssrs. Dobisch, Kirkeby, Vanderhoff and Eichelberger - on a rotating basis for their extramarital liaisons in return for a good word to the personnel director, Jeff D. Sheldrake. When Baxter is called into Sheldrake's office for the first time, he learns that it isn't just to be promoted as he expects, but also to add married Sheldrake to the list to who he will lend his apartment. Dobisch, Kirkeby, Vanderhoff and Eichelberger are now feeling neglected as Baxter no longer needs their assistance in moving up.",
    "language": "English",
    "country": "United States",
    "poster_url": "https://m.media-amazon.com/images/M/MV5BNDdhMzVhOWQtNDU2Mi00ZmZmLWJiZDMtY2QxMjhjY2Y1ZTI5XkEyXkFqcGc@._V1_SX300.jpg",
    "imdb_rating": "8.3"
  },
  {
    "imdb_id": "tt0056172",
    "title": "Lawrence of Arabia",
    "year": "1962",
    "rated": "PG",
    "runtime": "227 min",
    "genre": "Adventure, Biography, Drama",
    "director": "David Lean",
    "actors": "Peter O'Toole, Alec Guinness, Anthony Quinn",
    "plot": "Due to his knowledge of the native Bedouin tribes, British Lieutenant T.E. Lawrence is sent to Arabia to find Prince Faisal and serve as a liaison between the Arabs and the British in their fight against the Turks. With the aid of native Sherif Ali, Lawrence rebels against the orders of his superior officer and strikes out on a daring camel journey across the harsh desert to attack a well-guarded Turkish port.",
    "language": "English, Arabic, Turkish",
    "country": "United Kingdom, United States",
    "poster_url": "https://m.media-amazon.com/images/M/MV5BYjY0YTQ1OTAtYjEyNy00NTQ4LThlMTQtM2QwYTVhYWFhNjU5XkEyXkFqcGc@._V1_SX300.jpg",
    "imdb_rating": "8.3"
  },
  {
    "imdb_id": "tt0062622",
    "title": "2001: A Space Odyssey",
    "year": "1968",
    "rated": "G",
    "runtime": "149 min",
    "genre": "Adventure, Sci-Fi",
    "director": "Stanley Kubrick",
    "actors": "Keir Dullea, Gary Lockwood, William Sylvester",
    "plot": "\"2001\" is a story of evolution. Sometime in the distant past, someone or something nudged evolution by placing a monolith on Earth (presumably elsewhere throughout the universe as well). Evolution then enabled humankind to reach the moon's surface, where yet another monolith is found, one that signals the monolith placers that humankind has evolved that far. Now a race begins between computers (HAL) and human (Bowman) to reach the monolith placers. The winner will achieve the next step in evolution, whatever that may be.",
    "language": "English, Russian, French",
    "country": "United Kingdom, United States",
    "poster_url": "https://m.media-amazon.com/images/M/MV5BNjU0NDFkMTQtZWY5OS00MmZhLTg3Y2QtZmJhMzMzMWYyYjc2XkEyXkFqcGc@._V1_SX300.jpg",
    "imdb_rating": "8.3"
  },
  {
    "imdb_id": "tt0105236",
    "title": "Reservoir Dogs",
    "year": "1992",
    "rated": "R",
    "runtime": "99 min",
    "genre": "Crime, Thriller",
    "director": "Quentin Tarantino",
    "actors": "Harvey Keitel, Tim Roth, Michael Madsen",
    "plot": "Six thugs, who are strangers to each other, are hired by a crime boss, Joe Cabot, to carry out a diamond robbery. Right at the outset, they are given false names with the intention that they won't get too close and will concentrate on the job instead. They are completely sure that the robbery is going to be a success. But, when the police show up right at the time and the site of the robbery, panic spreads amongst the group members, and two of them are killed in the subsequent shootout, along with a few policemen and civilians. When the remaining people assemble at the premeditated rendezvous point (a warehouse), they begin to suspect that one of them is an undercover cop.",
    "language": "English",
    "country": "United States",
    "poster_url": "https://m.media-amazon.com/images/M/MV5BMmMzYjg4NDctYWY0Mi00OGViLWIzMTMtYWNlZGY5ZDJmYjk3XkEyXkFqcGc@._V1_SX300.jpg",
    "imdb_rating": "8.3"
  },
  {
    "imdb_id": "tt0086250",
    "title": "Scarface",
    "year": "1983",
    "rated": "R",
    "runtime": "170 min",
    "genre": "Crime, Drama",
    "director": "Brian De Palma",
    "actors": "Al Pacino, Michelle Pfeiffer, Steven Bauer",
    "plot": "Tony Montana manages to leave Cuba during the Mariel exodus of 1980. He finds himself in a Florida refugee camp but his friend Manny has a way out for them: undertake a contract killing and arrangements will be made to get a green card. He's soon working for drug dealer Frank Lopez and shows his mettle when a deal with Colombian drug dealers goes bad. He also brings a new level of violence to Miami. Tony is protective of his younger sister but his mother knows what he does for a living and disowns him. Tony is impatient and wants it all however, including Frank's empire and his mistress Elvira Hancock. Once at the top however, Tony's outrageous actions make him a target and everything comes crumbling down.",
    "language": "English, Spanish",
    "country": "United States",
    "poster_url": "https://m.media-amazon.com/images/M/MV5BNDUzYjY0NmUtMDM4OS00Y2Q5LWJiODYtNTk0ZTk0YjZhMTg1XkEyXkFqcGc@._V1_SX300.jpg",
    "imdb_rating": "8.3"
  },
  {
    "imdb_id": "tt0113277",
    "title": "Heat",
    "year": "1995",
    "rated": "R",
    "runtime": "170 min",
    "genre": "Action, Crime, Drama",
    "director": "Michael Mann",
    "actors": "Al Pacino, Robert De Niro, Val Kilmer",
    "plot": "Hunters and their prey--Neil and his professional criminal crew hunt to score big money targets (banks, vaults, armored cars) and are, in turn, hunted by Lt. Vincent Hanna and his team of cops in the Robbery/Homicide police division. A botched job puts Hanna onto their trail while they regroup and try to put together one last big 'retirement' score. Neil and Vincent are similar in many ways, including their troubled personal lives. At a crucial moment in his life, Neil disobeys the dictum taught to him long ago by his criminal mentor--'Never have anything in your life that you can't walk out on in thirty seconds flat, if you spot the heat coming around the corner'--as he falls in love. Thus the stage is set for the suspenseful ending....",
    "language": "English, Spanish",
    "country": "United States",
    "poster_url": "https://m.media-amazon.com/images/M/MV5BMTkxYjU1OTMtYWViZC00ZjAzLWI3MDktZGQ2N2VmMjVjNDRlXkEyXkFqcGc@._V1_SX300.jpg",
    "imdb_rating": "8.3"
  },
  {
    "imdb_id": "tt0036775",
    "title": "Double Indemnity",
    "year": "1944",
    "rated": "Approved",
    "runtime": "107 min",
    "genre": "Crime, Drama, Film-Noir",
    "director": "Billy Wilder",
    "actors": "Fred MacMurray, Barbara Stanwyck, Edward G. Robinson",
    "plot": "In 1938, Walter Neff, an experienced salesman of the Pacific All Risk Insurance Co., meets the seductive wife of one of his clients, Phyllis Dietrichson, and they have an affair. Phyllis proposes to kill her husband to receive the proceeds of an accident insurance policy and Walter devises a scheme to receive twice the amount based on a double indemnity clause. When Mr. Dietrichson is found dead on a train track, the police accept the determination of accidental death. However, the insurance analyst and Walter's best friend Barton Keyes does not buy the story and suspects that Phyllis has murdered her husband with the help of another man.",
    "language": "English",
    "country": "United States",
    "poster_url": "https://m.media-amazon.com/images/M/MV5BM2YwNjZlZDktNTlmNS00ODQwLWJmNmUtYmE1NTBhYjc1YTY5XkEyXkFqcGc@._V1_SX300.jpg",
    "imdb_rating": "8.3"
  },
  {
    "imdb_id": "tt1049413",
    "title": "Up",
    "year": "2009",
    "rated": "PG",
    "runtime": "96 min",
    "genre": "Animation, Adventure, Comedy",
    "director": "Pete Docter, Bob Peterson",
    "actors": "Edward Asner, Jordan Nagai, John Ratzenberger",
    "plot": "As a boy, Carl Fredricksen wanted to explore South America and find the forbidden Paradise Falls. About 64 years later he gets to begin his journey along with Boy Scout Russell by lifting his house with thousands of balloons. On their journey, they make many new friends including a talking dog, and figure out that someone has evil plans. Carl soon realizes that this evildoer is his childhood idol.",
    "language": "English",
    "country": "United States",
    "poster_url": "https://m.media-amazon.com/images/M/MV5BNmI1ZTc5MWMtMDYyOS00ZDc2LTkzOTAtNjQ4NWIxNjYyNDgzXkEyXkFqcGc@._V1_SX300.jpg",
    "imdb_rating": "8.3"
  },
  {
    "imdb_id": "tt0053125",
    "title": "North by Northwest",
    "year": "1959",
    "rated": "Approved",
    "runtime": "136 min",
    "genre": "Adventure, Drama, Mystery",
    "director": "Alfred Hitchcock",
    "actors": "Cary Grant, Eva Marie Saint, James Mason",
    "plot": "Madison Avenue advertising man Roger Thornhill finds himself thrust into the world of spies when he is mistaken for a man by the name of George Kaplan. Foreign spy Philip Vandamm and his henchman Leonard try to eliminate him but when Thornhill tries to make sense of the case, he is framed for murder. Now on the run from the police, he manages to board the 20th Century Limited bound for Chicago where he meets a beautiful blond, Eve Kendall, who helps him to evade the authorities. His world is turned upside down yet again when he learns that Eve isn't the innocent bystander he thought she was. Not all is as it seems however, leading to a dramatic rescue and escape at the top of Mt. Rushmore.",
    "language": "English, French",
    "country": "United States",
    "poster_url": "https://m.media-amazon.com/images/M/MV5BZWIzODI2OGItMzM0Ny00OGRmLTlkNmItMDQxMTFmMTk3YmQwXkEyXkFqcGc@._V1_SX300.jpg",
    "imdb_rating": "8.3"
  },
  {
    "imdb_id": "tt0022100",
    "title": "M",
    "year": "1931",
    "rated": "Passed",
    "runtime": "99 min",
    "genre": "Crime, Mystery, Thriller",
    "director": "Fritz Lang",
    "actors": "Peter Lorre, Ellen Widmann, Inge Landgut",
    "plot": "There have been a rash of child abductions and murders in Berlin. The murderer lures the children into his confidence by candy and other such child friendly items. Everyone is on edge because the murderer has not been caught. The most substantial pieces of evidence the police have are hand written letters by the murderer which he sent to the newspaper for publication. Unknown even to himself, a blind beggar, who sold the murderer a balloon for one of the child victims, may have key information as to the murderer's identity. The murder squad's work is made even more difficult with the large number of tips they receive from the paranoid public, who are quick to accuse anyone of suspicious activity solely for their own piece of mind that someone - anyone - is apprehended for the heinous crimes. Conversely, many want to take the case into their own hands, including the town's leading criminals since the increased police presence has placed a strain on their ability to conduct criminal activity. Although they both have the same end goal of capturing the murderer, the police and the criminals seem to be working at cross purposes, which may provide an edge to the murderer in getting away.",
    "language": "German",
    "country": "Germany",
    "poster_url": "https://m.media-amazon.com/images/M/MV5BODA4ODk3OTEzMF5BMl5BanBnXkFtZTgwMTQ2ODMwMzE@._V1_SX300.jpg",
    "imdb_rating": "8.3"
  },
  {
    "imdb_id": "tt0093058",
    "title": "Full Metal Jacket",
    "year": "1987",
    "rated": "R",
    "runtime": "116 min",
    "genre": "Drama, War",
    "director": "Stanley Kubrick",
    "actors": "Matthew Modine, R. Lee Ermey, Vincent D'Onofrio",
    "plot": "A two-segment look at the effect of the military mindset and war itself on Vietnam era Marines. The first half follows a group of recruits in boot camp under the command of the punishing Gunnery Sergeant Hartman. The second half shows one of those recruits, Joker, covering the war as a correspondent for Stars and Stripes, focusing on the Tet offensive.",
    "language": "English, Vietnamese",
    "country": "United Kingdom, United States",
    "poster_url": "https://m.media-amazon.com/images/M/MV5BYWUzNzZkNzUtNDdiYy00Nzk5LTgxMmItNTk0MjRjNjdjNDA0XkEyXkFqcGc@._V1_SX300.jpg",
    "imdb_rating": "8.2"
  },
  {
    "imdb_id": "tt0033467",
    "title": "Citizen Kane",
    "year": "1941",
    "rated": "PG",
    "runtime": "119 min",
    "genre": "Drama, Mystery",
    "director": "Orson Welles",
    "actors": "Orson Welles, Joseph Cotten, Dorothy Comingore",
    "plot": "A group of reporters are trying to decipher the last word ever spoken by Charles Foster Kane, the millionaire newspaper tycoon: \"Rosebud\". The film begins with a news reel detailing Kane's life for the masses, and then from there, we are shown flashbacks from Kane's life. As the reporters investigate further, the viewers see a display of a fascinating man's rise to fame, and how he eventually fell off the top of the world.",
    "language": "English, Italian",
    "country": "United States",
    "poster_url": "https://m.media-amazon.com/images/M/MV5BYjk1ZDJlMmUtOWQ0Zi00MDM5LTk1OGYtODczNjFmMGYwZGVkXkEyXkFqcGc@._V1_SX300.jpg",
    "imdb_rating": "8.2"
  },
  {
    "imdb_id": "tt0986264",
    "title": "Like Stars on Earth",
    "year": "2007",
    "rated": "PG",
    "runtime": "162 min",
    "genre": "Drama, Family",
    "director": "Aamir Khan",
    "actors": "Darsheel Safary, Aamir Khan, Tisca Chopra",
    "plot": "Ishaan Awasthi is an eight-year-old child whose world is filled with wonders that no one else seems to appretiate are just not important in the world of adults, who are much more interested in things like homework, marks and neatness. And Ishaan just cannot seem to get anything right in class. When he gets into far more trouble than his parents can handle, he is packed off to a boarding school to 'be disciplined'. Things are no different at his new school, and Ishaan has to contend with the added trauma of separation from his family. One day a new art teacher bursts onto the scene, Ram Shankar Nikumbh, who infects the students with joy and optimism. He breaks all the rules of 'how things are done' by asking them to think, dream and imagine, and all the children respond with enthusiasm, all except Ishaan. Nikumbh soon realizes that Ishaan is very unhappy, and he sets out to discover why. With time, patience and care, he ultimately helps Ishaan find himself.",
    "language": "Hindi, English",
    "country": "India",
    "poster_url": "https://m.media-amazon.com/images/M/MV5BNjVmMTlkNGYtYTM2OC00Yjc2LWIyYmQtMDY4ZmU1MWRlMjA3XkEyXkFqcGc@._V1_SX300.jpg",
    "imdb_rating": "8.3"
  },
  {
    "imdb_id": "tt0211915",
    "title": "Amélie",
    "year": "2001",
    "rated": "R",
    "runtime": "122 min",
    "genre": "Comedy, Romance",
    "director": "Jean-Pierre Jeunet",
    "actors": "Audrey Tautou, Mathieu Kassovitz, Rufus",
    "plot": "Amélie is a story about a girl named Amélie whose childhood was suppressed by her Father's mistaken concerns of a heart defect. With these concerns Amélie gets hardly any real-life contact with other people. This leads Amélie to resort to her own fantastical world and dreams of love and beauty. She later on becomes a young woman and moves to the central part of Paris as a waitress. After finding a lost treasure belonging to the former occupant of her apartment, she decides to return it to him. After seeing his reaction and his new found perspective - she decides to devote her life to the people around her. Such as, her father who is obsessed with his garden-gnome, a failed writer, a hypochondriac, a man who stalks his ex girlfriends, the \"ghost,\" a suppressed young soul, the love of her life and a man whose bones are as brittle as glass. But after consuming herself with these escapades - she finds out that she is disregarding her own life and damaging her quest for love. Amélie then discovers she must become more aggressive and take a hold of her life and capture the beauty of love she has always dreamed of.",
    "language": "French, Russian, English",
    "country": "France, Germany",
    "poster_url": "https://m.media-amazon.com/images/M/MV5BOTNmYzY0MWQtZGZmNy00Y2Y4LWFmMDQtMTZjYTdiYzEwZGQ2XkEyXkFqcGc@._V1_SX300.jpg",
    "imdb_rating": "8.3"
  },
  {
    "imdb_id": "tt0052357",
    "title": "Vertigo",
    "year": "1958",
    "rated": "PG",
    "runtime": "128 min",
    "genre": "Mystery, Romance, Thriller",
    "director": "Alfred Hitchcock",
    "actors": "James Stewart, Kim Novak, Barbara Bel Geddes",
    "plot": "Following his early retirement as a detective from the San Francisco Police Department, John Ferguson - Scottie to his friends - becomes obsessed with two women in succession, those obsessions which trouble his long time friend and former fiancée, Midge Wood, a designer of women's undergarments. The first is wealthy and elegant platinum blonde Madeleine Elster, the wife of his college acquaintance Gavin Elster, who hires John to follow her in Gavin's belief that she may be a danger to herself in thinking that she has recently been possessed by the spirit of Carlotta Valdes, Madeleine's great-grandmother who she knows nothing about, but who Gavin knows committed suicide in being mentally unbalanced when she was twenty-six, Madeleine's current age. The second is Judy Barton, who John spots on the street one day. Judy is a working class girl, but what makes John obsessed with her is that, despite her working class style and her brunette hair, she is the spitting image of Madeleine, into who he tries to transform Judy. The initial question that John has is if there is some connection between Madeleine and Judy. What happens between John and individually with Madeleine and Judy is affected by the reason John took that early retirement: a recent workplace incident that showed that he is acrophobic which leads to a severe case of vertigo whenever he looks down from tall heights.",
    "language": "English",
    "country": "United States",
    "poster_url": "https://m.media-amazon.com/images/M/MV5BNzEyZTUxMWItMGVhYy00Y2NlLTljYTMtYzBmMzI1YmUyMDBkXkEyXkFqcGc@._V1_SX300.jpg",
    "imdb_rating": "8.2"
  },
  {
    "imdb_id": "tt1832382",
    "title": "A Separation",
    "year": "2011",
    "rated": "PG-13",
    "runtime": "123 min",
    "genre": "Drama",
    "director": "Asghar Farhadi",
    "actors": "Leila Hatami, Payman Maadi, Shahab Hosseini",
    "plot": "Nader (Payman Maadi) and Simin (Leila Hatami) argue about living abroad. Simin prefers to live abroad to provide better opportunities for their only daughter, Termeh. However, Nader refuses to go because he thinks he must stay in Iran and take care of his father (Ali-Asghar Shahbazi), who suffers from Alzheimers. However, Simin is determined to get a divorce and leave the country with her daughter.",
    "language": "Persian",
    "country": "Iran, France, Australia",
    "poster_url": "https://m.media-amazon.com/images/M/MV5BMDM0ZWRmMzctM2M5ZS00ZjU0LWIxN2MtNWNlNGY1ZDhjMDVhXkEyXkFqcGc@._V1_SX300.jpg",
    "imdb_rating": "8.3"
  },
  {
    "imdb_id": "tt0095016",
    "title": "Die Hard",
    "year": "1988",
    "rated": "R",
    "runtime": "132 min",
    "genre": "Action, Thriller",
    "director": "John McTiernan",
    "actors": "Bruce Willis, Alan Rickman, Bonnie Bedelia",
    "plot": "NYPD cop John McClane goes on a Christmas vacation to visit his wife Holly in Los Angeles where she works for the Nakatomi Corporation. While they are at the Nakatomi headquarters for a Christmas party, a group of robbers led by Hans Gruber take control of the building and hold everyone hostage, with the exception of John, while they plan to perform a lucrative heist. Unable to escape and with no immediate police response, John is forced to take matters into his own hands.",
    "language": "English, German, Italian, Japanese",
    "country": "United States",
    "poster_url": "https://m.media-amazon.com/images/M/MV5BMGNlYmM1NmQtYWExMS00NmRjLTg5ZmEtMmYyYzJkMzljYWMxXkEyXkFqcGc@._V1_SX300.jpg",
    "imdb_rating": "8.2"
  },
  {
    "imdb_id": "tt0056592",
    "title": "To Kill a Mockingbird",
    "year": "1962",
    "rated": "Approved",
    "runtime": "129 min",
    "genre": "Crime, Drama",
    "director": "Robert Mulligan",
    "actors": "Gregory Peck, John Megna, Frank Overton",
    "plot": "Small-town Alabama, 1932. Atticus Finch (played by Gregory Peck) is a lawyer and a widower. He has two young children, Jem and Scout. Atticus Finch is currently defending Tom Robinson, a black man accused of raping a white woman. Meanwhile, Jem and Scout are intrigued by their neighbours, the Radleys, and the mysterious, seldom-seen Boo Radley in particular.",
    "language": "English",
    "country": "United States",
    "poster_url": "https://m.media-amazon.com/images/M/MV5BZTlkYWU4MGEtZmQyYi00OWEzLTgzY2EtYzVjOTEzYzAyNTk1XkEyXkFqcGc@._V1_SX300.jpg",
    "imdb_rating": "8.3"
  },
  {
    "imdb_id": "tt0097576",
    "title": "Indiana Jones and the Last Crusade",
    "year": "1989",
    "rated": "PG-13",
    "runtime": "127 min",
    "genre": "Action, Adventure",
    "director": "Steven Spielberg",
    "actors": "Harrison Ford, Sean Connery, Alison Doody",
    "plot": "An art collector appeals to Indiana Jones to embark on a search for the Holy Grail. He learns that another archaeologist has disappeared while searching for the precious goblet, and the missing man is his own father, Dr. Henry Jones. The artifact is much harder to find than they expected, and its powers are too much for those impure of heart.",
    "language": "English, German, Greek, Latin, Italian",
    "country": "United States, Italy, Spain, United Kingdom, Jordan",
    "poster_url": "https://m.media-amazon.com/images/M/MV5BNGIxNzQ0YzYtMjNmYi00YjBlLWFjNzEtNGE3ZGFmYTczM2MwXkEyXkFqcGc@._V1_SX300.jpg",
    "imdb_rating": "8.2"
  },
  {
    "imdb_id": "tt0070735",
    "title": "The Sting",
    "year": "1973",
    "rated": "PG",
    "runtime": "129 min",
    "genre": "Comedy, Crime, Drama",
    "director": "George Roy Hill",
    "actors": "Paul Newman, Robert Redford, Robert Shaw",
    "plot": "Johnny Hooker, a small time grifter, unknowingly steals from Doyle Lonnegan, a big time crime boss, when he pulls a standard street con. Lonnegan demands satisfaction for the insult. After his partner, Luther, is killed, Hooker flees, and seeks the help of Henry Gondorff, one of Luther's contacts, who is a master of the long con. Hooker wants to use Gondorff's expertise to take Lonnegan for an enormous sum of money to even the score, since he admits he \"doesn't know enough about killing to kill him.\" They devise a complicated scheme and amass a talented group of other con artists who want their share of the reparations. The stakes are high in this game, and our heroes must not only deal with Lonnegan's murderous tendencies, but also other side players who want a piece of the action. To win, Hooker and Gondorff will need all their skills...and a fair amount of confidence.",
    "language": "English",
    "country": "United States",
    "poster_url": "https://m.media-amazon.com/images/M/MV5BZGI4OTk4MDMtYmQ1Ni00YTUzLTkyYTktZGUwMjMyN2M4NjQ5XkEyXkFqcGc@._V1_SX300.jpg",
    "imdb_rating": "8.2"
  },
  {
    "imdb_id": "tt0066921",
    "title": "A Clockwork Orange",
    "year": "1971",
    "rated": "R",
    "runtime": "136 min",
    "genre": "Crime, Sci-Fi",
    "director": "Stanley Kubrick",
    "actors": "Malcolm McDowell, Patrick Magee, Michael Bates",
    "plot": "Protagonist Alex DeLarge is an \"ultraviolent\" youth in futuristic Britain. As with all luck, his eventually runs out and he's arrested and convicted of murder. While in prison, Alex learns of an experimental program in which convicts are programmed to detest violence. If he goes through the program, his sentence will be reduced and he will be back on the streets sooner than expected. But Alex's ordeals are far from over once he hits the streets of Britain..",
    "language": "English",
    "country": "United Kingdom, United States",
    "poster_url": "https://m.media-amazon.com/images/M/MV5BMTY3MjM1Mzc4N15BMl5BanBnXkFtZTgwODM0NzAxMDE@._V1_SX300.jpg",
    "imdb_rating": "8.2"
  },
  {
    "imdb_id": "tt0017136",
    "title": "Metropolis",
    "year": "1927",
    "rated": "Not Rated",
    "runtime": "153 min",
    "genre": "Drama, Sci-Fi",
    "director": "Fritz Lang",
    "actors": "Brigitte Helm, Alfred Abel, Gustav Fröhlich",
    "plot": "Sometime in the future, the city of Metropolis is home to a Utopian society where its wealthy residents live a carefree life. One of those is Freder Fredersen. One day, he spots a beautiful woman with a group of children, she and the children quickly disappear. Trying to follow her, he is horrified to find an underground world of workers who apparently run the machinery that keeps the Utopian world above ground functioning. One of the few people above ground who knows about the world below is Freder's father, John Fredersen, who is the founder and master of Metropolis. Freder learns that the woman is called Maria, who espouses the need to join the \"hands\" - the workers - to the \"head\" - those in power above - by a mediator who will act as the \"heart\". Freder wants to help the plight of the workers in their struggle for a better life. But when John learns of what Maria is advocating and that Freder has joined their cause, with the assistance of an old colleague. an inventor called Rotwang, who turns out to be But their nemesis goes to works towards quashing a proposed uprising, with Maria at the centre of their plan. John, unaware that Rotwang has his own agenda., makes plans that include shutting down the machines, with the prospect of unleashing total anarchy both above and below ground.",
    "language": "German, None",
    "country": "Germany",
    "poster_url": "https://m.media-amazon.com/images/M/MV5BMjhjMGYyMjAtMzJkYy00NzhlLWIwY2MtMWQ2ODIxZDUyOGYyXkEyXkFqcGc@._V1_SX300.jpg",
    "imdb_rating": "8.3"
  },
  {
    "imdb_id": "tt0208092",
    "title": "Snatch",
    "year": "2000",
    "rated": "R",
    "runtime": "102 min",
    "genre": "Comedy, Crime",
    "director": "Guy Ritchie",
    "actors": "Jason Statham, Brad Pitt, Stephen Graham",
    "plot": "Turkish and his close friend/accomplice Tommy get pulled into the world of match fixing by the notorious Brick Top. Things get complicated when the boxer they had lined up gets badly beaten by Mickey, who comes into the equation after Turkish, an unlicensed boxing promoter wants to buy a caravan off of Travellers. They then try to convince Mickey not only to fight for them, but to lose for them too. Whilst all this is going on, a huge diamond heist takes place, and a fistful of motley characters enter the story, including 'Cousin Avi', 'Boris The Blade', 'Franky Four Fingers' and 'Bullet Tooth Tony'. Things go from bad to worse as it all becomes about the money, the guns, and the damned dog.",
    "language": "English, Russian",
    "country": "United Kingdom, United States",
    "poster_url": "https://m.media-amazon.com/images/M/MV5BYzk5NjJkMTQtN2IyNC00YWM5LTlhZmMtNGI3MWNhMTU1YTc4XkEyXkFqcGc@._V1_SX300.jpg",
    "imdb_rating": "8.2"
  },
  {
    "imdb_id": "tt8579674",
    "title": "1917",
    "year": "2019",
    "rated": "R",
    "runtime": "119 min",
    "genre": "Action, Drama, War",
    "director": "Sam Mendes",
    "actors": "Dean-Charles Chapman, George MacKay, Daniel Mays",
    "plot": "April 1917, the Western Front. Two British soldiers are sent to deliver an urgent message to an isolated regiment. If the message is not received in time the regiment will walk into a trap and be massacred. To get to the regiment they will need to cross through enemy territory. Time is of the essence and the journey will be fraught with danger.",
    "language": "English, French, German",
    "country": "United Kingdom, United States",
    "poster_url": "https://m.media-amazon.com/images/M/MV5BYzkxZjg2NDQtMGVjMy00NWZkLTk0ZDEtZWE3NDYwYjAyMTg1XkEyXkFqcGc@._V1_SX300.jpg",
    "imdb_rating": "8.2"
  },
  {
    "imdb_id": "tt0119488",
    "title": "L.A. Confidential",
    "year": "1997",
    "rated": "R",
    "runtime": "138 min",
    "genre": "Crime, Drama, Mystery",
    "director": "Curtis Hanson",
    "actors": "Kevin Spacey, Russell Crowe, Guy Pearce",
    "plot": "1950's Los Angeles is the seedy backdrop for this intricate noir-ish tale of police corruption and Hollywood sleaze. Three very different cops are all after the truth, each in their own style: Ed Exley, the golden boy of the police force, willing to do almost anything to get ahead, except sell out; Bud White, ready to break the rules to seek justice, but barely able to keep his raging violence under control; and Jack Vincennes, always looking for celebrity and a quick buck until his conscience drives him to join Exley and White down the one-way path to find the truth behind the dark world of L.A. crime.",
    "language": "English",
    "country": "United States",
    "poster_url": "https://m.media-amazon.com/images/M/MV5BODdiMjY1OGYtNDk0NC00NGQ1LWI4MDItOTJhMTM0YjE1YTAzXkEyXkFqcGc@._V1_SX300.jpg",
    "imdb_rating": "8.2"
  },
  {
    "imdb_id": "tt15398776",
    "title": "Oppenheimer",
    "year": "2023",
    "rated": "R",
    "runtime": "180 min",
    "genre": "Biography, Drama, History",
    "director": "Christopher Nolan",
    "actors": "Cillian Murphy, Emily Blunt, Robert Downey Jr.",
    "plot": "A dramatization of the life story of J. Robert Oppenheimer, the physicist who had a large hand in the development of the atomic bombs that brought an end to World War II.",
    "language": "English, German, Italian, Dutch",
    "country": "United States, United Kingdom",
    "poster_url": "https://m.media-amazon.com/images/M/MV5BM2RmYmVmMzctMzc5Ny00MmNiLTgxMGUtYjk1ZDRhYjA2YTU0XkEyXkFqcGc@._V1_SX300.jpg",
    "imdb_rating": "8.3"
  },
  {
    "imdb_id": "tt0363163",
    "title": "Downfall",
    "year": "2004",
    "rated": "R",
    "runtime": "156 min",
    "genre": "Biography, Drama, History",
    "director": "Oliver Hirschbiegel",
    "actors": "Bruno Ganz, Alexandra Maria Lara, Ulrich Matthes",
    "plot": "Charting the last 10 days of Hitler's life, from his 56th birthday on April 20th, 1945 to his suicide on April 30th, Downfall uses multiple characters to show the chaos of a country coming apart at the seams, from Hitler's henchman under the streets of Berlin, to the soldiers and civilians fighting and dying as the Soviet Army ravaged the city above. Nominated for an Oscar for Best Foreign Language Film in 2005.",
    "language": "German, Russian, French, Hungarian, English",
    "country": "Germany, Austria, Italy",
    "poster_url": "https://m.media-amazon.com/images/M/MV5BMTU0NTU5NTAyMl5BMl5BanBnXkFtZTYwNzYwMDg2._V1_SX300.jpg",
    "imdb_rating": "8.2"
  },
  {
    "imdb_id": "tt0040522",
    "title": "Bicycle Thieves",
    "year": "1948",
    "rated": "Not Rated",
    "runtime": "89 min",
    "genre": "Drama",
    "director": "Vittorio De Sica",
    "actors": "Lamberto Maggiorani, Enzo Staiola, Lianella Carell",
    "plot": "Antonio Ricci, an unemployed man in the depressed post-WWII economy of Italy, finally gets a job hanging up posters, but he needs a bicycle. But when his bicycle is stolen,, he and son walk the streets of Rome looking for it. Antonio finally manages to locate the thief, but with no proof he must abandon his cause. But he and his son know perfectly well that without a bike, Antonio won't be able to keep his job.",
    "language": "Italian, German",
    "country": "Italy",
    "poster_url": "https://m.media-amazon.com/images/M/MV5BMjIzMzAyMzg1Nl5BMl5BanBnXkFtZTgwMzMyNzk0MTE@._V1_SX300.jpg",
    "imdb_rating": "8.2"
  }
]
